[Killed] ArrowFunction
src/rules.ts:29:21
 
 const { Error: Err, Warning: Warn } = DiagnosticSeverity
 
-const endpointKey = (e: HirEndpoint): string =>
-  isPinEndpoint(e) ? `${e.connector}:${e.pin}` : `splice:${e.splice}`
+const endpointKey = () => undefined
 
 /** Pins touched by at least one wire endpoint. */
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) passes once the drain lands on a wire
statusReason: expected [ { code: 'HK-ELEC-004', …(3) } ] to deeply equal []

[Killed] StringLiteral
src/rules.ts:30:22
 const { Error: Err, Warning: Warn } = DiagnosticSeverity
 
 const endpointKey = (e: HirEndpoint): string =>
-  isPinEndpoint(e) ? `${e.connector}:${e.pin}` : `splice:${e.splice}`
+  isPinEndpoint(e) ? `` : `splice:${e.splice}`
 
 /** Pins touched by at least one wire endpoint. */
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) passes once the drain lands on a wire
statusReason: expected [ { code: 'HK-ELEC-004', …(3) } ] to deeply equal []

[Killed] BlockStatement
src/rules.ts:33:54
   isPinEndpoint(e) ? `${e.connector}:${e.pin}` : `splice:${e.splice}`
 
 /** Pins touched by at least one wire endpoint. */
-const wiredPins = (hir: Hir): ReadonlySet<string> => {
-  const set = new Set<string>()
-  for (const w of hir.wires) {
-    set.add(endpointKey(w.from))
-    set.add(endpointKey(w.to))
-  }
-  return set
-}
+const wiredPins = (hir: Hir): ReadonlySet<string> => {}
 
 // --- Documentation ----------------------------------------------------------
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 1 tests
{ seed: -1877019418, path: "0:1:1:1:1:1:1:2:2:2:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{"1":"VBAT_24V"},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: r

[Killed] BlockStatement
src/rules.ts:35:30
 /** Pins touched by at least one wire endpoint. */
 const wiredPins = (hir: Hir): ReadonlySet<string> => {
   const set = new Set<string>()
-  for (const w of hir.wires) {
-    set.add(endpointKey(w.from))
-    set.add(endpointKey(w.to))
-  }
+  for (const w of hir.wires) {}
   return set
 }
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) passes once the drain lands on a wire
statusReason: expected [ { code: 'HK-ELEC-004', …(3) } ] to deeply equal []

[Killed] StringLiteral
src/rules.ts:45:3
 // --- Documentation ----------------------------------------------------------
 
 export const missingRevision: Rule = rule(
-  "missingRevision",
+  "",
   (ctx) => {
     if (ctx.hir.harness.revision.trim() === "") {
killedBy: HK-DOC-001 missingRevision fires on whitespace-only revision
statusReason: expected [] to deeply equal [ 'HK-DOC-001' ]

[Killed] BlockStatement
src/rules.ts:46:12
 
 export const missingRevision: Rule = rule(
   "missingRevision",
-  (ctx) => {
-    if (ctx.hir.harness.revision.trim() === "") {
-      ctx.report({
-        severity: Err,
-        message: `Harness ${ctx.hir.harness.id} has no revision.`
-      })
-    }
-  },
+  (ctx) => {},
   { code: "HK-DOC-001" }
 )
killedBy: HK-DOC-001 missingRevision fires on whitespace-only revision
statusReason: expected [] to deeply equal [ 'HK-DOC-001' ]

[Killed] EqualityOperator
src/rules.ts:47:9
 export const missingRevision: Rule = rule(
   "missingRevision",
   (ctx) => {
-    if (ctx.hir.harness.revision.trim() === "") {
+    if (ctx.hir.harness.revision.trim() !== "") {
       ctx.report({
         severity: Err,
killedBy: HK-DOC-001 missingRevision fires on whitespace-only revision
statusReason: expected [] to deeply equal [ 'HK-DOC-001' ]

[Killed] ConditionalExpression
src/rules.ts:47:9
 export const missingRevision: Rule = rule(
   "missingRevision",
   (ctx) => {
-    if (ctx.hir.harness.revision.trim() === "") {
+    if (true) {
       ctx.report({
         severity: Err,
killedBy: HK-DOC-001 missingRevision passes with a real revision
statusReason: expected [ { code: 'HK-DOC-001', …(2) } ] to deeply equal []

[Killed] StringLiteral
src/rules.ts:50:18
     if (ctx.hir.harness.revision.trim() === "") {
       ctx.report({
         severity: Err,
-        message: `Harness ${ctx.hir.harness.id} has no revision.`
+        message: ``
       })
     }
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 1 tests
{ seed: -62419230, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,
      pin: String(pin)
    })

[Killed] ObjectLiteral
src/rules.ts:54:3
       })
     }
   },
-  { code: "HK-DOC-001" }
+  {}
 )
 
killedBy: rule code numbers round-trips every built-in rule code
statusReason: HK-RULE-MISSINGREVISION: expected undefined to be defined

[Killed] StringLiteral
src/rules.ts:58:3
 )
 
 export const branchMissingLabel: Rule = rule(
-  "branchMissingLabel",
+  "",
   (ctx) => {
     const labeled = new Set(ctx.hir.labels.map((l) => l.attachTo))
killedBy: HK-DOC-002 branchMissingLabel fires for an unlabeled branch with the branch target
statusReason: expected [] to deeply equal [ 'HK-DOC-002' ]

[Killed] BlockStatement
src/rules.ts:59:12
 
 export const branchMissingLabel: Rule = rule(
   "branchMissingLabel",
-  (ctx) => {
-    const labeled = new Set(ctx.hir.labels.map((l) => l.attachTo))
-    for (const b of ctx.hir.branches) {
-      if (!labeled.has(b.id)) {
-        ctx.report({
-          severity: Warn,
-          message: `Branch ${b.id} has no label attached.`,
-          target: refs.branch(b.id)
-        })
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-DOC-002" }
 )
killedBy: HK-DOC-002 branchMissingLabel fires for an unlabeled branch with the branch target
statusReason: expected [] to deeply equal [ 'HK-DOC-002' ]

[Killed] ArrowFunction
src/rules.ts:60:48
 export const branchMissingLabel: Rule = rule(
   "branchMissingLabel",
   (ctx) => {
-    const labeled = new Set(ctx.hir.labels.map((l) => l.attachTo))
+    const labeled = new Set(ctx.hir.labels.map(() => undefined))
     for (const b of ctx.hir.branches) {
       if (!labeled.has(b.id)) {
killedBy: HK-DOC-002 branchMissingLabel passes when a label attaches to the branch
statusReason: expected [ { code: 'HK-DOC-002', …(3) } ] to deeply equal []

[Killed] BlockStatement
src/rules.ts:61:39
   "branchMissingLabel",
   (ctx) => {
     const labeled = new Set(ctx.hir.labels.map((l) => l.attachTo))
-    for (const b of ctx.hir.branches) {
-      if (!labeled.has(b.id)) {
-        ctx.report({
-          severity: Warn,
-          message: `Branch ${b.id} has no label attached.`,
-          target: refs.branch(b.id)
-        })
-      }
-    }
+    for (const b of ctx.hir.branches) {}
   },
   { code: "HK-DOC-002" }
killedBy: HK-DOC-002 branchMissingLabel fires for an unlabeled branch with the branch target
statusReason: expected [] to deeply equal [ 'HK-DOC-002' ]

[Killed] BlockStatement
src/rules.ts:62:31
   (ctx) => {
     const labeled = new Set(ctx.hir.labels.map((l) => l.attachTo))
     for (const b of ctx.hir.branches) {
-      if (!labeled.has(b.id)) {
-        ctx.report({
-          severity: Warn,
-          message: `Branch ${b.id} has no label attached.`,
-          target: refs.branch(b.id)
-        })
-      }
+      if (!labeled.has(b.id)) {}
     }
   },
killedBy: HK-DOC-002 branchMissingLabel fires for an unlabeled branch with the branch target
statusReason: expected [] to deeply equal [ 'HK-DOC-002' ]

[Killed] BooleanLiteral
src/rules.ts:62:11
   (ctx) => {
     const labeled = new Set(ctx.hir.labels.map((l) => l.attachTo))
     for (const b of ctx.hir.branches) {
-      if (!labeled.has(b.id)) {
+      if (labeled.has(b.id)) {
         ctx.report({
           severity: Warn,
killedBy: HK-DOC-002 branchMissingLabel fires for an unlabeled branch with the branch target
statusReason: expected [] to deeply equal [ 'HK-DOC-002' ]

[Killed] BlockStatement
src/rules.ts:76:12
 
 export const spliceMissingNotes: Rule = rule(
   "spliceMissingNotes",
-  (ctx) => {
-    for (const s of ctx.hir.splices) {
-      if (s.notes === undefined && s.type === undefined && s.part === undefined) {
-        ctx.report({
-          severity: Warn,
-          message: `Splice ${s.id} has no type, part, or manufacturing notes.`,
-          target: refs.splice(s.id)
-        })
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-DOC-003" }
 )
killedBy: HK-DOC-003 spliceMissingNotes fires when type, part, and notes are all absent
statusReason: expected [] to deeply equal [ 'HK-DOC-003' ]

[Killed] BlockStatement
src/rules.ts:77:38
 export const spliceMissingNotes: Rule = rule(
   "spliceMissingNotes",
   (ctx) => {
-    for (const s of ctx.hir.splices) {
-      if (s.notes === undefined && s.type === undefined && s.part === undefined) {
-        ctx.report({
-          severity: Warn,
-          message: `Splice ${s.id} has no type, part, or manufacturing notes.`,
-          target: refs.splice(s.id)
-        })
-      }
-    }
+    for (const s of ctx.hir.splices) {}
   },
   { code: "HK-DOC-003" }
killedBy: HK-DOC-003 spliceMissingNotes fires when type, part, and notes are all absent
statusReason: expected [] to deeply equal [ 'HK-DOC-003' ]

[Killed] ConditionalExpression
src/rules.ts:78:11
   "spliceMissingNotes",
   (ctx) => {
     for (const s of ctx.hir.splices) {
-      if (s.notes === undefined && s.type === undefined && s.part === undefined) {
+      if (false) {
         ctx.report({
           severity: Warn,
killedBy: HK-DOC-003 spliceMissingNotes fires when type, part, and notes are all absent
statusReason: expected [] to deeply equal [ 'HK-DOC-003' ]

[Killed] ConditionalExpression
src/rules.ts:78:36
   "spliceMissingNotes",
   (ctx) => {
     for (const s of ctx.hir.splices) {
-      if (s.notes === undefined && s.type === undefined && s.part === undefined) {
+      if (s.notes === undefined && true && s.part === undefined) {
         ctx.report({
           severity: Warn,
killedBy: HK-DOC-003 spliceMissingNotes passes with any one of type / notes
statusReason: expected [ { code: 'HK-DOC-003', …(3) } ] to deeply equal []

[Killed] ObjectLiteral
src/rules.ts:87:3
       }
     }
   },
-  { code: "HK-DOC-003" }
+  {}
 )
 
killedBy: rule code numbers round-trips every built-in rule code
statusReason: HK-RULE-SPLICEMISSINGNOTES: expected undefined to be defined

[Killed] StringLiteral
src/rules.ts:93:3
 // --- Manufacturing ----------------------------------------------------------
 
 export const missingWireLength: Rule = rule(
-  "missingWireLength",
+  "",
   (ctx) => {
     for (const w of ctx.hir.wires) {
killedBy: HK-MFG-001/002/003 missing length/color/gauge each fires independently
statusReason: expected [] to deeply equal [ 'HK-MFG-001' ]

[Killed] BlockStatement
src/rules.ts:94:12
 
 export const missingWireLength: Rule = rule(
   "missingWireLength",
-  (ctx) => {
-    for (const w of ctx.hir.wires) {
-      if (w.length === undefined) {
-        ctx.report({
-          severity: Warn,
-          message: `Wire ${w.id} has no length; the cut list cannot include it.`,
-          target: refs.wire(w.id)
-        })
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-MFG-001" }
 )
killedBy: HK-MFG-001/002/003 missing length/color/gauge each fires independently
statusReason: expected [] to deeply equal [ 'HK-MFG-001' ]

[Killed] BlockStatement
src/rules.ts:95:36
 export const missingWireLength: Rule = rule(
   "missingWireLength",
   (ctx) => {
-    for (const w of ctx.hir.wires) {
-      if (w.length === undefined) {
-        ctx.report({
-          severity: Warn,
-          message: `Wire ${w.id} has no length; the cut list cannot include it.`,
-          target: refs.wire(w.id)
-        })
-      }
-    }
+    for (const w of ctx.hir.wires) {}
   },
   { code: "HK-MFG-001" }
killedBy: HK-MFG-001/002/003 missing length/color/gauge each fires independently
statusReason: expected [] to deeply equal [ 'HK-MFG-001' ]

[Killed] EqualityOperator
src/rules.ts:96:11
   "missingWireLength",
   (ctx) => {
     for (const w of ctx.hir.wires) {
-      if (w.length === undefined) {
+      if (w.length !== undefined) {
         ctx.report({
           severity: Warn,
killedBy: HK-MFG-001/002/003 missing length/color/gauge each fires independently
statusReason: expected [] to deeply equal [ 'HK-MFG-001' ]

[Killed] ConditionalExpression
src/rules.ts:96:11
   "missingWireLength",
   (ctx) => {
     for (const w of ctx.hir.wires) {
-      if (w.length === undefined) {
+      if (true) {
         ctx.report({
           severity: Warn,
killedBy: metamorphic laws fully specifying every wire eliminates all MFG missing-field diagnostics
statusReason: Property failed after 1 tests
{ seed: -1740922980, path: "0:0:0:0:0:0:0:1:0:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] ObjectLiteral
src/rules.ts:105:3
       }
     }
   },
-  { code: "HK-MFG-001" }
+  {}
 )
 
killedBy: HK-MFG-001/002/003 missing length/color/gauge each fires independently
statusReason: expected [ 'HK-RULE-MISSINGWIRELENGTH' ] to deeply equal [ 'HK-MFG-001' ]

[Killed] BlockStatement
src/rules.ts:110:12
 
 export const missingWireColor: Rule = rule(
   "missingWireColor",
-  (ctx) => {
-    for (const w of ctx.hir.wires) {
-      if (w.color === undefined) {
-        ctx.report({
-          severity: Err,
-          message: `Wire ${w.id} has no color.`,
-          target: refs.wire(w.id)
-        })
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-MFG-002" }
 )
killedBy: HK-MFG-001/002/003 missing length/color/gauge length is a warning; color and gauge are errors
statusReason: expected undefined to be 'error' // Object.is equality

[Killed] BlockStatement
src/rules.ts:111:36
 export const missingWireColor: Rule = rule(
   "missingWireColor",
   (ctx) => {
-    for (const w of ctx.hir.wires) {
-      if (w.color === undefined) {
-        ctx.report({
-          severity: Err,
-          message: `Wire ${w.id} has no color.`,
-          target: refs.wire(w.id)
-        })
-      }
-    }
+    for (const w of ctx.hir.wires) {}
   },
   { code: "HK-MFG-002" }
killedBy: HK-MFG-001/002/003 missing length/color/gauge length is a warning; color and gauge are errors
statusReason: expected undefined to be 'error' // Object.is equality

[Killed] ConditionalExpression
src/rules.ts:112:11
   "missingWireColor",
   (ctx) => {
     for (const w of ctx.hir.wires) {
-      if (w.color === undefined) {
+      if (true) {
         ctx.report({
           severity: Err,
killedBy: HK-MFG-001/002/003 missing length/color/gauge each fires independently
statusReason: expected [ { code: 'HK-MFG-002', …(3) } ] to deeply equal []

[Killed] EqualityOperator
src/rules.ts:112:11
   "missingWireColor",
   (ctx) => {
     for (const w of ctx.hir.wires) {
-      if (w.color === undefined) {
+      if (w.color !== undefined) {
         ctx.report({
           severity: Err,
killedBy: metamorphic laws fully specifying every wire eliminates all MFG missing-field diagnostics
statusReason: Property failed after 1 tests
{ seed: 1727010389, path: "0:0:0:0:0:0:0:0:0:1:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] StringLiteral
src/rules.ts:115:20
       if (w.color === undefined) {
         ctx.report({
           severity: Err,
-          message: `Wire ${w.id} has no color.`,
+          message: ``,
           target: refs.wire(w.id)
         })
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 1 tests
{ seed: -1726501201, path: "0:0:0:0:0:0:0:1:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] BlockStatement
src/rules.ts:126:12
 
 export const missingWireGauge: Rule = rule(
   "missingWireGauge",
-  (ctx) => {
-    for (const w of ctx.hir.wires) {
-      if (w.gauge === undefined) {
-        ctx.report({
-          severity: Err,
-          message: `Wire ${w.id} has no gauge.`,
-          target: refs.wire(w.id)
-        })
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-MFG-003" }
 )
killedBy: HK-MFG-001/002/003 missing length/color/gauge length is a warning; color and gauge are errors
statusReason: expected undefined to be 'error' // Object.is equality

[Killed] BlockStatement
src/rules.ts:127:36
 export const missingWireGauge: Rule = rule(
   "missingWireGauge",
   (ctx) => {
-    for (const w of ctx.hir.wires) {
-      if (w.gauge === undefined) {
-        ctx.report({
-          severity: Err,
-          message: `Wire ${w.id} has no gauge.`,
-          target: refs.wire(w.id)
-        })
-      }
-    }
+    for (const w of ctx.hir.wires) {}
   },
   { code: "HK-MFG-003" }
killedBy: HK-MFG-001/002/003 missing length/color/gauge length is a warning; color and gauge are errors
statusReason: expected undefined to be 'error' // Object.is equality

[Killed] ConditionalExpression
src/rules.ts:128:11
   "missingWireGauge",
   (ctx) => {
     for (const w of ctx.hir.wires) {
-      if (w.gauge === undefined) {
+      if (true) {
         ctx.report({
           severity: Err,
killedBy: HK-MFG-001/002/003 missing length/color/gauge each fires independently
statusReason: expected [ { code: 'HK-MFG-003', …(3) } ] to deeply equal []

[Killed] EqualityOperator
src/rules.ts:128:11
   "missingWireGauge",
   (ctx) => {
     for (const w of ctx.hir.wires) {
-      if (w.gauge === undefined) {
+      if (w.gauge !== undefined) {
         ctx.report({
           severity: Err,
killedBy: metamorphic laws fully specifying every wire eliminates all MFG missing-field diagnostics
statusReason: Property failed after 1 tests
{ seed: -406978862, path: "0:0:0:0:0:0:0:1:0:0:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] BlockStatement
src/rules.ts:142:12
 
 export const gaugeOutsideConnectorRange: Rule = rule(
   "gaugeOutsideConnectorRange",
-  (ctx) => {
-    const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
-    for (const w of ctx.hir.wires) {
-      const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
-      if (awg === undefined) continue
-      for (const end of [w.from, w.to]) {
-        if (!isPinEndpoint(end)) continue
-        const range = byRef.get(end.connector)?.wireGaugeRange
-        if (range === undefined) continue
-        const thinnest = parseAwg(range.min)
-        const thickest = parseAwg(range.max)
-        if (thinnest === undefined || thickest === undefined) continue
-        // Larger AWG number = thinner wire.
-        if (awg > thinnest || awg < thickest) {
-          ctx.report({
-            severity: Err,
-            message: `Wire ${w.id} uses ${w.gauge} but connector ${end.connector} accepts ${range.max} to ${range.min}.`,
-            target: refs.pin(end.connector, end.pin)
-          })
-        }
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-MFG-004" }
 )
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] ArrowFunction
src/rules.ts:143:50
 export const gaugeOutsideConnectorRange: Rule = rule(
   "gaugeOutsideConnectorRange",
   (ctx) => {
-    const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
+    const byRef = new Map(ctx.hir.connectors.map(() => undefined))
     for (const w of ctx.hir.wires) {
       const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) boundaries are inclusive: exactly min and exactly max pass
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/rules.ts:143:57
 export const gaugeOutsideConnectorRange: Rule = rule(
   "gaugeOutsideConnectorRange",
   (ctx) => {
-    const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
+    const byRef = new Map(ctx.hir.connectors.map((c) => []))
     for (const w of ctx.hir.wires) {
       const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] BlockStatement
src/rules.ts:144:36
   "gaugeOutsideConnectorRange",
   (ctx) => {
     const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
-    for (const w of ctx.hir.wires) {
-      const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
-      if (awg === undefined) continue
-      for (const end of [w.from, w.to]) {
-        if (!isPinEndpoint(end)) continue
-        const range = byRef.get(end.connector)?.wireGaugeRange
-        if (range === undefined) continue
-        const thinnest = parseAwg(range.min)
-        const thickest = parseAwg(range.max)
-        if (thinnest === undefined || thickest === undefined) continue
-        // Larger AWG number = thinner wire.
-        if (awg > thinnest || awg < thickest) {
-          ctx.report({
-            severity: Err,
-            message: `Wire ${w.id} uses ${w.gauge} but connector ${end.connector} accepts ${range.max} to ${range.min}.`,
-            target: refs.pin(end.connector, end.pin)
-          })
-        }
-      }
-    }
+    for (const w of ctx.hir.wires) {}
   },
   { code: "HK-MFG-004" }
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] ConditionalExpression
src/rules.ts:145:19
   (ctx) => {
     const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
     for (const w of ctx.hir.wires) {
-      const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
+      const awg = false ? parseAwg(w.gauge) : undefined
       if (awg === undefined) continue
       for (const end of [w.from, w.to]) {
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] ConditionalExpression
src/rules.ts:145:19
   (ctx) => {
     const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
     for (const w of ctx.hir.wires) {
-      const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
+      const awg = true ? parseAwg(w.gauge) : undefined
       if (awg === undefined) continue
       for (const end of [w.from, w.to]) {
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 1 tests
{ seed: -1457172353, path: "0:0:0:0:0:0:0:1:0:0:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] EqualityOperator
src/rules.ts:146:11
     const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
     for (const w of ctx.hir.wires) {
       const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
-      if (awg === undefined) continue
+      if (awg !== undefined) continue
       for (const end of [w.from, w.to]) {
         if (!isPinEndpoint(end)) continue
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] ConditionalExpression
src/rules.ts:146:11
     const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
     for (const w of ctx.hir.wires) {
       const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
-      if (awg === undefined) continue
+      if (true) continue
       for (const end of [w.from, w.to]) {
         if (!isPinEndpoint(end)) continue
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] BlockStatement
src/rules.ts:147:41
     for (const w of ctx.hir.wires) {
       const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
       if (awg === undefined) continue
-      for (const end of [w.from, w.to]) {
-        if (!isPinEndpoint(end)) continue
-        const range = byRef.get(end.connector)?.wireGaugeRange
-        if (range === undefined) continue
-        const thinnest = parseAwg(range.min)
-        const thickest = parseAwg(range.max)
-        if (thinnest === undefined || thickest === undefined) continue
-        // Larger AWG number = thinner wire.
-        if (awg > thinnest || awg < thickest) {
-          ctx.report({
-            severity: Err,
-            message: `Wire ${w.id} uses ${w.gauge} but connector ${end.connector} accepts ${range.max} to ${range.min}.`,
-            target: refs.pin(end.connector, end.pin)
-          })
-        }
-      }
+      for (const end of [w.from, w.to]) {}
     }
   },
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] BooleanLiteral
src/rules.ts:148:13
       const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
       if (awg === undefined) continue
       for (const end of [w.from, w.to]) {
-        if (!isPinEndpoint(end)) continue
+        if (isPinEndpoint(end)) continue
         const range = byRef.get(end.connector)?.wireGaugeRange
         if (range === undefined) continue
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] ConditionalExpression
src/rules.ts:148:13
       const awg = w.gauge !== undefined ? parseAwg(w.gauge) : undefined
       if (awg === undefined) continue
       for (const end of [w.from, w.to]) {
-        if (!isPinEndpoint(end)) continue
+        if (true) continue
         const range = byRef.get(end.connector)?.wireGaugeRange
         if (range === undefined) continue
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Survived] OptionalChaining
src/rules.ts:149:23
       if (awg === undefined) continue
       for (const end of [w.from, w.to]) {
         if (!isPinEndpoint(end)) continue
-        const range = byRef.get(end.connector)?.wireGaugeRange
+        const range = byRef.get(end.connector).wireGaugeRange
         if (range === undefined) continue
         const thinnest = parseAwg(range.min)

[Killed] ConditionalExpression
src/rules.ts:150:13
       for (const end of [w.from, w.to]) {
         if (!isPinEndpoint(end)) continue
         const range = byRef.get(end.connector)?.wireGaugeRange
-        if (range === undefined) continue
+        if (true) continue
         const thinnest = parseAwg(range.min)
         const thickest = parseAwg(range.max)
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] ConditionalExpression
src/rules.ts:150:13
       for (const end of [w.from, w.to]) {
         if (!isPinEndpoint(end)) continue
         const range = byRef.get(end.connector)?.wireGaugeRange
-        if (range === undefined) continue
+        if (false) continue
         const thinnest = parseAwg(range.min)
         const thickest = parseAwg(range.max)
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) skips wires without a parseable gauge and connectors without a range
statusReason: Cannot read properties of undefined (reading 'min')
