[Killed] EqualityOperator
src/rules.ts:153:13
         if (range === undefined) continue
         const thinnest = parseAwg(range.min)
         const thickest = parseAwg(range.max)
-        if (thinnest === undefined || thickest === undefined) continue
+        if (thinnest !== undefined || thickest === undefined) continue
         // Larger AWG number = thinner wire.
         if (awg > thinnest || awg < thickest) {
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] EqualityOperator
src/rules.ts:153:39
         if (range === undefined) continue
         const thinnest = parseAwg(range.min)
         const thickest = parseAwg(range.max)
-        if (thinnest === undefined || thickest === undefined) continue
+        if (thinnest === undefined || thickest !== undefined) continue
         // Larger AWG number = thinner wire.
         if (awg > thinnest || awg < thickest) {
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) one step outside fires at both endpoints of the wire
statusReason: expected [] to deeply equal [ 'HK-MFG-004', 'HK-MFG-004' ]

[Killed] EqualityOperator
src/rules.ts:155:31
         const thickest = parseAwg(range.max)
         if (thinnest === undefined || thickest === undefined) continue
         // Larger AWG number = thinner wire.
-        if (awg > thinnest || awg < thickest) {
+        if (awg > thinnest || awg <= thickest) {
           ctx.report({
             severity: Err,
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) boundaries are inclusive: exactly min and exactly max pass
statusReason: expected [ { code: 'HK-MFG-004', …(3) }, …(1) ] to deeply equal []

[Killed] EqualityOperator
src/rules.ts:155:13
         const thickest = parseAwg(range.max)
         if (thinnest === undefined || thickest === undefined) continue
         // Larger AWG number = thinner wire.
-        if (awg > thinnest || awg < thickest) {
+        if (awg <= thinnest || awg < thickest) {
           ctx.report({
             severity: Err,
killedBy: HK-MFG-004 gaugeOutsideConnectorRange (range 30AWG..18AWG) boundaries are inclusive: exactly min and exactly max pass
statusReason: expected [ { code: 'HK-MFG-004', …(3) }, …(1) ] to deeply equal []

[Killed] StringLiteral
src/rules.ts:171:3
 // --- Electrical sanity ------------------------------------------------------
 
 export const gaugeCurrentMismatch: Rule = rule(
-  "gaugeCurrentMismatch",
+  "",
   (ctx) => {
     for (const w of ctx.hir.wires) {
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] BlockStatement
src/rules.ts:172:12
 
 export const gaugeCurrentMismatch: Rule = rule(
   "gaugeCurrentMismatch",
-  (ctx) => {
-    for (const w of ctx.hir.wires) {
-      if (w.currentEstimate === undefined || w.gauge === undefined) continue
-      const awg = parseAwg(w.gauge)
-      if (awg === undefined) continue
-      const ampacity = AMPACITY_BY_AWG[awg]
-      if (ampacity === undefined) continue
-      if (w.currentEstimate > ampacity) {
-        const required = requiredAwgForCurrent(w.currentEstimate)
-        const suffix =
-          required !== undefined
-            ? ` requires at least ${required}AWG`
-            : ` exceeds the ampacity table`
-        ctx.report({
-          severity: Err,
-          message: `Wire ${w.id} uses ${w.gauge} but its ${w.currentEstimate}A estimate${suffix}.`,
-          target: refs.wire(w.id)
-        })
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-WIRE-004" }
 )
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] BlockStatement
src/rules.ts:173:36
 export const gaugeCurrentMismatch: Rule = rule(
   "gaugeCurrentMismatch",
   (ctx) => {
-    for (const w of ctx.hir.wires) {
-      if (w.currentEstimate === undefined || w.gauge === undefined) continue
-      const awg = parseAwg(w.gauge)
-      if (awg === undefined) continue
-      const ampacity = AMPACITY_BY_AWG[awg]
-      if (ampacity === undefined) continue
-      if (w.currentEstimate > ampacity) {
-        const required = requiredAwgForCurrent(w.currentEstimate)
-        const suffix =
-          required !== undefined
-            ? ` requires at least ${required}AWG`
-            : ` exceeds the ampacity table`
-        ctx.report({
-          severity: Err,
-          message: `Wire ${w.id} uses ${w.gauge} but its ${w.currentEstimate}A estimate${suffix}.`,
-          target: refs.wire(w.id)
-        })
-      }
-    }
+    for (const w of ctx.hir.wires) {}
   },
   { code: "HK-WIRE-004" }
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] ConditionalExpression
src/rules.ts:174:11
   "gaugeCurrentMismatch",
   (ctx) => {
     for (const w of ctx.hir.wires) {
-      if (w.currentEstimate === undefined || w.gauge === undefined) continue
+      if (false) continue
       const awg = parseAwg(w.gauge)
       if (awg === undefined) continue
killedBy: rule engine severity can be overridden per rule without changing the code
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
src/rules.ts:174:11
   "gaugeCurrentMismatch",
   (ctx) => {
     for (const w of ctx.hir.wires) {
-      if (w.currentEstimate === undefined || w.gauge === undefined) continue
+      if (w.currentEstimate !== undefined || w.gauge === undefined) continue
       const awg = parseAwg(w.gauge)
       if (awg === undefined) continue
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] EqualityOperator
src/rules.ts:176:11
     for (const w of ctx.hir.wires) {
       if (w.currentEstimate === undefined || w.gauge === undefined) continue
       const awg = parseAwg(w.gauge)
-      if (awg === undefined) continue
+      if (awg !== undefined) continue
       const ampacity = AMPACITY_BY_AWG[awg]
       if (ampacity === undefined) continue
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] ConditionalExpression
src/rules.ts:176:11
     for (const w of ctx.hir.wires) {
       if (w.currentEstimate === undefined || w.gauge === undefined) continue
       const awg = parseAwg(w.gauge)
-      if (awg === undefined) continue
+      if (true) continue
       const ampacity = AMPACITY_BY_AWG[awg]
       if (ampacity === undefined) continue
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] EqualityOperator
src/rules.ts:178:11
       const awg = parseAwg(w.gauge)
       if (awg === undefined) continue
       const ampacity = AMPACITY_BY_AWG[awg]
-      if (ampacity === undefined) continue
+      if (ampacity !== undefined) continue
       if (w.currentEstimate > ampacity) {
         const required = requiredAwgForCurrent(w.currentEstimate)
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] ConditionalExpression
src/rules.ts:178:11
       const awg = parseAwg(w.gauge)
       if (awg === undefined) continue
       const ampacity = AMPACITY_BY_AWG[awg]
-      if (ampacity === undefined) continue
+      if (true) continue
       if (w.currentEstimate > ampacity) {
         const required = requiredAwgForCurrent(w.currentEstimate)
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] EqualityOperator
src/rules.ts:179:11
       if (awg === undefined) continue
       const ampacity = AMPACITY_BY_AWG[awg]
       if (ampacity === undefined) continue
-      if (w.currentEstimate > ampacity) {
+      if (w.currentEstimate <= ampacity) {
         const required = requiredAwgForCurrent(w.currentEstimate)
         const suffix =
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [ { code: 'HK-WIRE-004', …(3) } ] to deeply equal []

[Killed] BlockStatement
src/rules.ts:179:41
       if (awg === undefined) continue
       const ampacity = AMPACITY_BY_AWG[awg]
       if (ampacity === undefined) continue
-      if (w.currentEstimate > ampacity) {
-        const required = requiredAwgForCurrent(w.currentEstimate)
-        const suffix =
-          required !== undefined
-            ? ` requires at least ${required}AWG`
-            : ` exceeds the ampacity table`
-        ctx.report({
-          severity: Err,
-          message: `Wire ${w.id} uses ${w.gauge} but its ${w.currentEstimate}A estimate${suffix}.`,
-          target: refs.wire(w.id)
-        })
-      }
+      if (w.currentEstimate > ampacity) {}
     }
   },
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected [] to deeply equal [ 'HK-WIRE-004' ]

[Killed] EqualityOperator
src/rules.ts:182:11
       if (w.currentEstimate > ampacity) {
         const required = requiredAwgForCurrent(w.currentEstimate)
         const suffix =
-          required !== undefined
+          required === undefined
             ? ` requires at least ${required}AWG`
             : ` exceeds the ampacity table`
killedBy: HK-WIRE-004 gaugeCurrentMismatch exactly at ampacity passes; just over fires
statusReason: expected 'Wire W1 uses 20AWG but its 3.8A estim…' to contain 'requires at least 18AWG'

[Killed] ConditionalExpression
src/rules.ts:182:11
       if (w.currentEstimate > ampacity) {
         const required = requiredAwgForCurrent(w.currentEstimate)
         const suffix =
-          required !== undefined
+          true
             ? ` requires at least ${required}AWG`
             : ` exceeds the ampacity table`
killedBy: HK-WIRE-004 gaugeCurrentMismatch current beyond the whole table says so
statusReason: expected 'Wire W1 uses 10AWG but its 50A estima…' to contain 'exceeds the ampacity table'

[Killed] StringLiteral
src/rules.ts:184:15
         const suffix =
           required !== undefined
             ? ` requires at least ${required}AWG`
-            : ` exceeds the ampacity table`
+            : ``
         ctx.report({
           severity: Err,
killedBy: HK-WIRE-004 gaugeCurrentMismatch current beyond the whole table says so
statusReason: expected 'Wire W1 uses 10AWG but its 50A estima…' to contain 'exceeds the ampacity table'

[Killed] ObjectLiteral
src/rules.ts:193:3
       }
     }
   },
-  { code: "HK-WIRE-004" }
+  {}
 )
 
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 1 tests
{ seed: -1559450006, path: "0:0:0:0:0:0:0:1:0:0:1:1:1:1:1:1:1:1:3:3:1:4:1:1:2:1:1:5:1:4:2:2", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",

[Killed] StringLiteral
src/rules.ts:197:3
 )
 
 export const differentialPairNotTwisted: Rule = rule(
-  "differentialPairNotTwisted",
+  "",
   (ctx) => {
     const bySignal = new Map<string, Array<(typeof ctx.hir.wires)[number]>>()
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/rules.ts:200:36
   "differentialPairNotTwisted",
   (ctx) => {
     const bySignal = new Map<string, Array<(typeof ctx.hir.wires)[number]>>()
-    for (const w of ctx.hir.wires) {
-      if (w.signal === undefined) continue
-      const list = bySignal.get(w.signal.toUpperCase()) ?? []
-      list.push(w)
-      bySignal.set(w.signal.toUpperCase(), list)
-    }
+    for (const w of ctx.hir.wires) {}
     for (const [signal, wires] of [...bySignal.entries()].sort()) {
       const partner = differentialPartner(signal)
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/rules.ts:201:11
   (ctx) => {
     const bySignal = new Map<string, Array<(typeof ctx.hir.wires)[number]>>()
     for (const w of ctx.hir.wires) {
-      if (w.signal === undefined) continue
+      if (w.signal !== undefined) continue
       const list = bySignal.get(w.signal.toUpperCase()) ?? []
       list.push(w)
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/rules.ts:201:11
   (ctx) => {
     const bySignal = new Map<string, Array<(typeof ctx.hir.wires)[number]>>()
     for (const w of ctx.hir.wires) {
-      if (w.signal === undefined) continue
+      if (false) continue
       const list = bySignal.get(w.signal.toUpperCase()) ?? []
       list.push(w)
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 3 tests
{ seed: 1003662322, path: "2:0:0:0:0:0:0:0:2:0:1:2:2:2:2:2:2:2:2:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] LogicalOperator
src/rules.ts:202:20
     const bySignal = new Map<string, Array<(typeof ctx.hir.wires)[number]>>()
     for (const w of ctx.hir.wires) {
       if (w.signal === undefined) continue
-      const list = bySignal.get(w.signal.toUpperCase()) ?? []
+      const list = bySignal.get(w.signal.toUpperCase()) && []
       list.push(w)
       bySignal.set(w.signal.toUpperCase(), list)
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: Cannot read properties of undefined (reading 'push')

[Survived] MethodExpression
src/rules.ts:202:33
     const bySignal = new Map<string, Array<(typeof ctx.hir.wires)[number]>>()
     for (const w of ctx.hir.wires) {
       if (w.signal === undefined) continue
-      const list = bySignal.get(w.signal.toUpperCase()) ?? []
+      const list = bySignal.get(w.signal.toLowerCase()) ?? []
       list.push(w)
       bySignal.set(w.signal.toUpperCase(), list)

[Killed] MethodExpression
src/rules.ts:204:20
       if (w.signal === undefined) continue
       const list = bySignal.get(w.signal.toUpperCase()) ?? []
       list.push(w)
-      bySignal.set(w.signal.toUpperCase(), list)
+      bySignal.set(w.signal.toLowerCase(), list)
     }
     for (const [signal, wires] of [...bySignal.entries()].sort()) {
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/rules.ts:206:67
       list.push(w)
       bySignal.set(w.signal.toUpperCase(), list)
     }
-    for (const [signal, wires] of [...bySignal.entries()].sort()) {
-      const partner = differentialPartner(signal)
-      if (partner === undefined || !bySignal.has(partner)) continue
-      // Report each pair once, from the lexically smaller signal.
-      if (partner < signal) continue
-      const partnerWires = bySignal.get(partner) ?? []
-      for (const w of wires) {
-        const mate = partnerWires.find(
-          (p) => p.twistGroup !== undefined && p.twistGroup === w.twistGroup
-        )
-        if (w.twistGroup === undefined || mate === undefined) {
-          ctx.report({
-            severity: Err,
-            message: `Differential pair ${signal}/${partner} (wire ${w.id}) must share a twist group.`,
-            target: refs.wire(w.id)
-          })
-        }
-      }
-    }
+    for (const [signal, wires] of [...bySignal.entries()].sort()) {}
   },
   { code: "HK-ELEC-001" }
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
src/rules.ts:206:35
       list.push(w)
       bySignal.set(w.signal.toUpperCase(), list)
     }
-    for (const [signal, wires] of [...bySignal.entries()].sort()) {
+    for (const [signal, wires] of [...bySignal.entries()]) {
       const partner = differentialPartner(signal)
       if (partner === undefined || !bySignal.has(partner)) continue

[Killed] ConditionalExpression
src/rules.ts:208:11
     }
     for (const [signal, wires] of [...bySignal.entries()].sort()) {
       const partner = differentialPartner(signal)
-      if (partner === undefined || !bySignal.has(partner)) continue
+      if (true) continue
       // Report each pair once, from the lexically smaller signal.
       if (partner < signal) continue
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/rules.ts:208:11
     }
     for (const [signal, wires] of [...bySignal.entries()].sort()) {
       const partner = differentialPartner(signal)
-      if (partner === undefined || !bySignal.has(partner)) continue
+      if (false) continue
       // Report each pair once, from the lexically smaller signal.
       if (partner < signal) continue
killedBy: HK-ELEC-001 differentialPairNotTwisted a lone CAN_H with no CAN_L present is not a pair violation
statusReason: expected [ { code: 'HK-ELEC-001', …(3) } ] to deeply equal []

[Killed] ConditionalExpression
src/rules.ts:210:11
       const partner = differentialPartner(signal)
       if (partner === undefined || !bySignal.has(partner)) continue
       // Report each pair once, from the lexically smaller signal.
-      if (partner < signal) continue
+      if (true) continue
       const partnerWires = bySignal.get(partner) ?? []
       for (const w of wires) {
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
src/rules.ts:210:11
       const partner = differentialPartner(signal)
       if (partner === undefined || !bySignal.has(partner)) continue
       // Report each pair once, from the lexically smaller signal.
-      if (partner < signal) continue
+      if (false) continue
       const partnerWires = bySignal.get(partner) ?? []
       for (const w of wires) {

[Killed] LogicalOperator
src/rules.ts:211:28
       if (partner === undefined || !bySignal.has(partner)) continue
       // Report each pair once, from the lexically smaller signal.
       if (partner < signal) continue
-      const partnerWires = bySignal.get(partner) ?? []
+      const partnerWires = bySignal.get(partner) && []
       for (const w of wires) {
         const mate = partnerWires.find(
killedBy: HK-ELEC-001 differentialPairNotTwisted passes when the pair shares a twist group
statusReason: expected [ { code: 'HK-ELEC-001', …(3) } ] to deeply equal []

[NoCoverage] ArrayDeclaration
src/rules.ts:211:53
       if (partner === undefined || !bySignal.has(partner)) continue
       // Report each pair once, from the lexically smaller signal.
       if (partner < signal) continue
-      const partnerWires = bySignal.get(partner) ?? []
+      const partnerWires = bySignal.get(partner) ?? ["Stryker was here"]
       for (const w of wires) {
         const mate = partnerWires.find(

[Killed] BlockStatement
src/rules.ts:212:30
       // Report each pair once, from the lexically smaller signal.
       if (partner < signal) continue
       const partnerWires = bySignal.get(partner) ?? []
-      for (const w of wires) {
-        const mate = partnerWires.find(
-          (p) => p.twistGroup !== undefined && p.twistGroup === w.twistGroup
-        )
-        if (w.twistGroup === undefined || mate === undefined) {
-          ctx.report({
-            severity: Err,
-            message: `Differential pair ${signal}/${partner} (wire ${w.id}) must share a twist group.`,
-            target: refs.wire(w.id)
-          })
-        }
-      }
+      for (const w of wires) {}
     }
   },
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/rules.ts:214:48
       const partnerWires = bySignal.get(partner) ?? []
       for (const w of wires) {
         const mate = partnerWires.find(
-          (p) => p.twistGroup !== undefined && p.twistGroup === w.twistGroup
+          (p) => p.twistGroup !== undefined && p.twistGroup !== w.twistGroup
         )
         if (w.twistGroup === undefined || mate === undefined) {
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/rules.ts:214:18
       const partnerWires = bySignal.get(partner) ?? []
       for (const w of wires) {
         const mate = partnerWires.find(
-          (p) => p.twistGroup !== undefined && p.twistGroup === w.twistGroup
+          (p) => false
         )
         if (w.twistGroup === undefined || mate === undefined) {
killedBy: HK-ELEC-001 differentialPairNotTwisted passes when the pair shares a twist group
statusReason: expected [ { code: 'HK-ELEC-001', …(3) } ] to deeply equal []

[Killed] ConditionalExpression
src/rules.ts:216:13
         const mate = partnerWires.find(
           (p) => p.twistGroup !== undefined && p.twistGroup === w.twistGroup
         )
-        if (w.twistGroup === undefined || mate === undefined) {
+        if (false) {
           ctx.report({
             severity: Err,
killedBy: HK-ELEC-001 differentialPairNotTwisted fires when neither wire is twisted, and when groups differ
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/rules.ts:216:13
         const mate = partnerWires.find(
           (p) => p.twistGroup !== undefined && p.twistGroup === w.twistGroup
         )
-        if (w.twistGroup === undefined || mate === undefined) {
+        if (w.twistGroup !== undefined || mate === undefined) {
           ctx.report({
             severity: Err,
killedBy: HK-ELEC-001 differentialPairNotTwisted passes when the pair shares a twist group
statusReason: expected [ { code: 'HK-ELEC-001', …(3) } ] to deeply equal []

[Killed] StringLiteral
src/rules.ts:219:22
         if (w.twistGroup === undefined || mate === undefined) {
           ctx.report({
             severity: Err,
-            message: `Differential pair ${signal}/${partner} (wire ${w.id}) must share a twist group.`,
+            message: ``,
             target: refs.wire(w.id)
           })
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 74 tests
{ seed: -1912545089, path: "73:0:0:0:0:0:0:2:0:1:2:2:2:2:2:4:4:5:4:4:4:4:4:4:6:6:6", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      co

[Killed] ObjectLiteral
src/rules.ts:226:3
       }
     }
   },
-  { code: "HK-ELEC-001" }
+  {}
 )
 
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 28 tests
{ seed: -855993226, path: "27:0:0:0:0:0:0:0:2:1:2:2:2:2:2:4:6:6:6:6:6:6:6:6:8:8:8:8:6", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",

[Killed] StringLiteral
src/rules.ts:230:3
 )
 
 export const twistGroupTooSmall: Rule = rule(
-  "twistGroupTooSmall",
+  "",
   (ctx) => {
     const counts = new Map<string, number>()
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]

[Killed] BlockStatement
src/rules.ts:231:12
 
 export const twistGroupTooSmall: Rule = rule(
   "twistGroupTooSmall",
-  (ctx) => {
-    const counts = new Map<string, number>()
-    for (const w of ctx.hir.wires) {
-      if (w.twistGroup === undefined) continue
-      counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
-    }
-    for (const [group, count] of [...counts.entries()].sort()) {
-      if (count < 2) {
-        ctx.report({
-          severity: Err,
-          message: `Twist group ${group} contains only ${count} wire; twisting requires at least 2.`
-        })
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-ELEC-002" }
 )
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]

[Killed] BlockStatement
src/rules.ts:233:36
   "twistGroupTooSmall",
   (ctx) => {
     const counts = new Map<string, number>()
-    for (const w of ctx.hir.wires) {
-      if (w.twistGroup === undefined) continue
-      counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
-    }
+    for (const w of ctx.hir.wires) {}
     for (const [group, count] of [...counts.entries()].sort()) {
       if (count < 2) {
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]

[Killed] ConditionalExpression
src/rules.ts:234:11
   (ctx) => {
     const counts = new Map<string, number>()
     for (const w of ctx.hir.wires) {
-      if (w.twistGroup === undefined) continue
+      if (true) continue
       counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
     }
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]

[Killed] EqualityOperator
src/rules.ts:234:11
   (ctx) => {
     const counts = new Map<string, number>()
     for (const w of ctx.hir.wires) {
-      if (w.twistGroup === undefined) continue
+      if (w.twistGroup !== undefined) continue
       counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
     }
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]

[Killed] ArithmeticOperator
src/rules.ts:235:32
     const counts = new Map<string, number>()
     for (const w of ctx.hir.wires) {
       if (w.twistGroup === undefined) continue
-      counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
+      counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) - 1)
     }
     for (const [group, count] of [...counts.entries()].sort()) {
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [ { code: 'HK-ELEC-002', …(2) } ] to deeply equal []

[Killed] LogicalOperator
src/rules.ts:235:33
     const counts = new Map<string, number>()
     for (const w of ctx.hir.wires) {
       if (w.twistGroup === undefined) continue
-      counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
+      counts.set(w.twistGroup, (counts.get(w.twistGroup) && 0) + 1)
     }
     for (const [group, count] of [...counts.entries()].sort()) {
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]

[Killed] BlockStatement
src/rules.ts:237:64
       if (w.twistGroup === undefined) continue
       counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
     }
-    for (const [group, count] of [...counts.entries()].sort()) {
-      if (count < 2) {
-        ctx.report({
-          severity: Err,
-          message: `Twist group ${group} contains only ${count} wire; twisting requires at least 2.`
-        })
-      }
-    }
+    for (const [group, count] of [...counts.entries()].sort()) {}
   },
   { code: "HK-ELEC-002" }
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]

[Survived] MethodExpression
src/rules.ts:237:34
       if (w.twistGroup === undefined) continue
       counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
     }
-    for (const [group, count] of [...counts.entries()].sort()) {
+    for (const [group, count] of [...counts.entries()]) {
       if (count < 2) {
         ctx.report({

[Killed] ConditionalExpression
src/rules.ts:238:11
       counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
     }
     for (const [group, count] of [...counts.entries()].sort()) {
-      if (count < 2) {
+      if (false) {
         ctx.report({
           severity: Err,
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]
