[Killed] BlockStatement
src/rules.ts:238:22
       counts.set(w.twistGroup, (counts.get(w.twistGroup) ?? 0) + 1)
     }
     for (const [group, count] of [...counts.entries()].sort()) {
-      if (count < 2) {
-        ctx.report({
-          severity: Err,
-          message: `Twist group ${group} contains only ${count} wire; twisting requires at least 2.`
-        })
-      }
+      if (count < 2) {}
     }
   },
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [] to deeply equal [ 'HK-ELEC-002' ]

[Killed] ObjectLiteral
src/rules.ts:239:20
     }
     for (const [group, count] of [...counts.entries()].sort()) {
       if (count < 2) {
-        ctx.report({
-          severity: Err,
-          message: `Twist group ${group} contains only ${count} wire; twisting requires at least 2.`
-        })
+        ctx.report({})
       }
     }
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 3 tests
{ seed: -1448258113, path: "2:0:0:0:0:0:0:0:2:1:2:2:2:2:2:3:3:3:2", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] ObjectLiteral
src/rules.ts:246:3
       }
     }
   },
-  { code: "HK-ELEC-002" }
+  {}
 )
 
killedBy: HK-ELEC-002 twistGroupTooSmall a singleton group fires; a pair passes; two singletons sort deterministically
statusReason: expected [ 'HK-RULE-TWISTGROUPTOOSMALL' ] to deeply equal [ 'HK-ELEC-002' ]

[Killed] StringLiteral
src/rules.ts:250:3
 )
 
 export const missingGroundReturn: Rule = rule(
-  "missingGroundReturn",
+  "",
   (ctx) => {
     const signals = ctx.hir.wires
killedBy: HK-ELEC-003 missingGroundReturn power without ground fires, listing unique sorted rails
statusReason: expected [] to deeply equal [ 'HK-ELEC-003' ]

[Killed] BlockStatement
src/rules.ts:251:12
 
 export const missingGroundReturn: Rule = rule(
   "missingGroundReturn",
-  (ctx) => {
-    const signals = ctx.hir.wires
-      .map((w) => w.signal)
-      .filter((s): s is string => s !== undefined)
-    const power = signals.filter(isPowerSignal)
-    const hasGround = signals.some(isGroundSignal)
-    if (power.length > 0 && !hasGround) {
-      ctx.report({
-        severity: Err,
-        message: `Power signals (${[...new Set(power)].sort().join(", ")}) have no ground return wire.`
-      })
-    }
-  },
+  (ctx) => {},
   { code: "HK-ELEC-003" }
 )
killedBy: HK-ELEC-003 missingGroundReturn power without ground fires, listing unique sorted rails
statusReason: expected [] to deeply equal [ 'HK-ELEC-003' ]

[Survived] MethodExpression
src/rules.ts:252:21
 export const missingGroundReturn: Rule = rule(
   "missingGroundReturn",
   (ctx) => {
-    const signals = ctx.hir.wires
-      .map((w) => w.signal)
-      .filter((s): s is string => s !== undefined)
+    const signals = ctx.hir.wires.map(w => w.signal)
     const power = signals.filter(isPowerSignal)
     const hasGround = signals.some(isGroundSignal)

[Killed] ArrowFunction
src/rules.ts:253:12
   "missingGroundReturn",
   (ctx) => {
     const signals = ctx.hir.wires
-      .map((w) => w.signal)
+      .map(() => undefined)
       .filter((s): s is string => s !== undefined)
     const power = signals.filter(isPowerSignal)
killedBy: HK-ELEC-003 missingGroundReturn power without ground fires, listing unique sorted rails
statusReason: expected [] to deeply equal [ 'HK-ELEC-003' ]

[Killed] ArrowFunction
src/rules.ts:254:15
   (ctx) => {
     const signals = ctx.hir.wires
       .map((w) => w.signal)
-      .filter((s): s is string => s !== undefined)
+      .filter(() => undefined)
     const power = signals.filter(isPowerSignal)
     const hasGround = signals.some(isGroundSignal)
killedBy: HK-ELEC-003 missingGroundReturn power without ground fires, listing unique sorted rails
statusReason: expected [] to deeply equal [ 'HK-ELEC-003' ]

[Killed] ConditionalExpression
src/rules.ts:254:35
   (ctx) => {
     const signals = ctx.hir.wires
       .map((w) => w.signal)
-      .filter((s): s is string => s !== undefined)
+      .filter((s): s is string => false)
     const power = signals.filter(isPowerSignal)
     const hasGround = signals.some(isGroundSignal)
killedBy: HK-ELEC-003 missingGroundReturn power without ground fires, listing unique sorted rails
statusReason: expected [] to deeply equal [ 'HK-ELEC-003' ]

[Killed] MethodExpression
src/rules.ts:255:19
     const signals = ctx.hir.wires
       .map((w) => w.signal)
       .filter((s): s is string => s !== undefined)
-    const power = signals.filter(isPowerSignal)
+    const power = signals
     const hasGround = signals.some(isGroundSignal)
     if (power.length > 0 && !hasGround) {
killedBy: HK-ELEC-003 missingGroundReturn passes with a ground wire, and with no power at all
statusReason: expected [ { code: 'HK-ELEC-003', …(2) } ] to deeply equal []

[Killed] MethodExpression
src/rules.ts:256:23
       .map((w) => w.signal)
       .filter((s): s is string => s !== undefined)
     const power = signals.filter(isPowerSignal)
-    const hasGround = signals.some(isGroundSignal)
+    const hasGround = signals.every(isGroundSignal)
     if (power.length > 0 && !hasGround) {
       ctx.report({
killedBy: HK-ELEC-003 missingGroundReturn passes with a ground wire, and with no power at all
statusReason: expected [ { code: 'HK-ELEC-003', …(2) } ] to deeply equal []

[Killed] LogicalOperator
src/rules.ts:257:9
       .filter((s): s is string => s !== undefined)
     const power = signals.filter(isPowerSignal)
     const hasGround = signals.some(isGroundSignal)
-    if (power.length > 0 && !hasGround) {
+    if (power.length > 0 || !hasGround) {
       ctx.report({
         severity: Err,
killedBy: HK-ELEC-003 missingGroundReturn passes with a ground wire, and with no power at all
statusReason: expected [ { code: 'HK-ELEC-003', …(2) } ] to deeply equal []

[Killed] EqualityOperator
src/rules.ts:257:9
       .filter((s): s is string => s !== undefined)
     const power = signals.filter(isPowerSignal)
     const hasGround = signals.some(isGroundSignal)
-    if (power.length > 0 && !hasGround) {
+    if (power.length <= 0 && !hasGround) {
       ctx.report({
         severity: Err,
killedBy: HK-ELEC-003 missingGroundReturn power without ground fires, listing unique sorted rails
statusReason: expected [] to deeply equal [ 'HK-ELEC-003' ]

[Killed] MethodExpression
src/rules.ts:260:36
     if (power.length > 0 && !hasGround) {
       ctx.report({
         severity: Err,
-        message: `Power signals (${[...new Set(power)].sort().join(", ")}) have no ground return wire.`
+        message: `Power signals (${[...new Set(power)].join(", ")}) have no ground return wire.`
       })
     }
killedBy: HK-ELEC-003 missingGroundReturn power without ground fires, listing unique sorted rails
statusReason: expected 'Power signals (VBAT_24V, 5V) have no …' to contain '5V, VBAT_24V'

[Killed] StringLiteral
src/rules.ts:260:18
     if (power.length > 0 && !hasGround) {
       ctx.report({
         severity: Err,
-        message: `Power signals (${[...new Set(power)].sort().join(", ")}) have no ground return wire.`
+        message: ``
       })
     }
killedBy: HK-ELEC-003 missingGroundReturn power without ground fires, listing unique sorted rails
statusReason: expected '' to contain '5V, VBAT_24V'

[Killed] BlockStatement
src/rules.ts:269:12
 
 export const shieldDrainUnconnected: Rule = rule(
   "shieldDrainUnconnected",
-  (ctx) => {
-    const wired = wiredPins(ctx.hir)
-    for (const c of ctx.hir.connectors) {
-      for (const p of c.pins) {
-        if (p.signal === undefined || !isShieldSignal(p.signal)) continue
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Shield drain pin ${c.ref}.${p.pin} (${p.signal}) has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-ELEC-004" }
 )
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) fires as a warning for an unwired shield pin; CONN-010 stays silent for it
statusReason: expected [] to deeply equal [ 'HK-ELEC-004' ]

[Killed] BlockStatement
src/rules.ts:271:41
   "shieldDrainUnconnected",
   (ctx) => {
     const wired = wiredPins(ctx.hir)
-    for (const c of ctx.hir.connectors) {
-      for (const p of c.pins) {
-        if (p.signal === undefined || !isShieldSignal(p.signal)) continue
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Shield drain pin ${c.ref}.${p.pin} (${p.signal}) has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
+    for (const c of ctx.hir.connectors) {}
   },
   { code: "HK-ELEC-004" }
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) fires as a warning for an unwired shield pin; CONN-010 stays silent for it
statusReason: expected [] to deeply equal [ 'HK-ELEC-004' ]

[Killed] BlockStatement
src/rules.ts:272:31
   (ctx) => {
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
-      for (const p of c.pins) {
-        if (p.signal === undefined || !isShieldSignal(p.signal)) continue
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Shield drain pin ${c.ref}.${p.pin} (${p.signal}) has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
+      for (const p of c.pins) {}
     }
   },
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) fires as a warning for an unwired shield pin; CONN-010 stays silent for it
statusReason: expected [] to deeply equal [ 'HK-ELEC-004' ]

[Killed] EqualityOperator
src/rules.ts:273:13
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
       for (const p of c.pins) {
-        if (p.signal === undefined || !isShieldSignal(p.signal)) continue
+        if (p.signal !== undefined || !isShieldSignal(p.signal)) continue
         if (!wired.has(`${c.ref}:${p.pin}`)) {
           ctx.report({
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) fires as a warning for an unwired shield pin; CONN-010 stays silent for it
statusReason: expected [] to deeply equal [ 'HK-ELEC-004' ]

[Killed] ConditionalExpression
src/rules.ts:273:13
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
       for (const p of c.pins) {
-        if (p.signal === undefined || !isShieldSignal(p.signal)) continue
+        if (false) continue
         if (!wired.has(`${c.ref}:${p.pin}`)) {
           ctx.report({
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) fires as a warning for an unwired shield pin; CONN-010 stays silent for it
statusReason: expected [ 'HK-ELEC-004', 'HK-ELEC-004' ] to deeply equal [ 'HK-ELEC-004' ]

[Killed] BlockStatement
src/rules.ts:274:46
     for (const c of ctx.hir.connectors) {
       for (const p of c.pins) {
         if (p.signal === undefined || !isShieldSignal(p.signal)) continue
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Shield drain pin ${c.ref}.${p.pin} (${p.signal}) has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
+        if (!wired.has(`${c.ref}:${p.pin}`)) {}
       }
     }
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) fires as a warning for an unwired shield pin; CONN-010 stays silent for it
statusReason: expected [] to deeply equal [ 'HK-ELEC-004' ]

[Killed] ConditionalExpression
src/rules.ts:274:13
     for (const c of ctx.hir.connectors) {
       for (const p of c.pins) {
         if (p.signal === undefined || !isShieldSignal(p.signal)) continue
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
+        if (false) {
           ctx.report({
             severity: Warn,
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) fires as a warning for an unwired shield pin; CONN-010 stays silent for it
statusReason: expected [] to deeply equal [ 'HK-ELEC-004' ]

[Killed] StringLiteral
src/rules.ts:284:11
       }
     }
   },
-  { code: "HK-ELEC-004" }
+  { code: "" }
 )
 
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 6 tests
{ seed: -442322503, path: "5:0:0:2:0:2:2", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{"1":"SHIELD"},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,
      pin: String

[Killed] BlockStatement
src/rules.ts:291:12
 
 export const unconnectedAssignedPin: Rule = rule(
   "unconnectedAssignedPin",
-  (ctx) => {
-    const wired = wiredPins(ctx.hir)
-    for (const c of ctx.hir.connectors) {
-      for (const p of c.pins) {
-        if (p.signal === undefined) continue
-        if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Pin ${c.ref}.${p.pin} is assigned signal ${p.signal} but has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-CONN-010" }
 )
killedBy: HK-CONN-010 unconnectedAssignedPin fires for an assigned, unwired pin; unassigned pins are fine
statusReason: expected [] to deeply equal [ 'connector:J1.pin:1' ]

[Killed] BlockStatement
src/rules.ts:293:41
   "unconnectedAssignedPin",
   (ctx) => {
     const wired = wiredPins(ctx.hir)
-    for (const c of ctx.hir.connectors) {
-      for (const p of c.pins) {
-        if (p.signal === undefined) continue
-        if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Pin ${c.ref}.${p.pin} is assigned signal ${p.signal} but has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
+    for (const c of ctx.hir.connectors) {}
   },
   { code: "HK-CONN-010" }
killedBy: HK-CONN-010 unconnectedAssignedPin fires for an assigned, unwired pin; unassigned pins are fine
statusReason: expected [] to deeply equal [ 'connector:J1.pin:1' ]

[Killed] BlockStatement
src/rules.ts:294:31
   (ctx) => {
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
-      for (const p of c.pins) {
-        if (p.signal === undefined) continue
-        if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Pin ${c.ref}.${p.pin} is assigned signal ${p.signal} but has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
+      for (const p of c.pins) {}
     }
   },
killedBy: HK-CONN-010 unconnectedAssignedPin fires for an assigned, unwired pin; unassigned pins are fine
statusReason: expected [] to deeply equal [ 'connector:J1.pin:1' ]

[Killed] EqualityOperator
src/rules.ts:295:13
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
       for (const p of c.pins) {
-        if (p.signal === undefined) continue
+        if (p.signal !== undefined) continue
         if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
         if (!wired.has(`${c.ref}:${p.pin}`)) {
killedBy: HK-CONN-010 unconnectedAssignedPin fires for an assigned, unwired pin; unassigned pins are fine
statusReason: expected [] to deeply equal [ 'connector:J1.pin:1' ]

[Killed] ConditionalExpression
src/rules.ts:295:13
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
       for (const p of c.pins) {
-        if (p.signal === undefined) continue
+        if (true) continue
         if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
         if (!wired.has(`${c.ref}:${p.pin}`)) {
killedBy: HK-CONN-010 unconnectedAssignedPin fires for an assigned, unwired pin; unassigned pins are fine
statusReason: expected [] to deeply equal [ 'connector:J1.pin:1' ]

[Killed] ConditionalExpression
src/rules.ts:296:13
     for (const c of ctx.hir.connectors) {
       for (const p of c.pins) {
         if (p.signal === undefined) continue
-        if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
+        if (false) continue // covered by shieldDrainUnconnected
         if (!wired.has(`${c.ref}:${p.pin}`)) {
           ctx.report({
killedBy: HK-ELEC-004 shieldDrainUnconnected (+ HK-CONN-010 exclusion) fires as a warning for an unwired shield pin; CONN-010 stays silent for it
statusReason: expected [ 'connector:J1.pin:1', …(1) ] to not include 'connector:J1.pin:1'

[Killed] ConditionalExpression
src/rules.ts:296:13
     for (const c of ctx.hir.connectors) {
       for (const p of c.pins) {
         if (p.signal === undefined) continue
-        if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
+        if (true) continue // covered by shieldDrainUnconnected
         if (!wired.has(`${c.ref}:${p.pin}`)) {
           ctx.report({
killedBy: HK-CONN-010 unconnectedAssignedPin fires for an assigned, unwired pin; unassigned pins are fine
statusReason: expected [] to deeply equal [ 'connector:J1.pin:1' ]

[Killed] BlockStatement
src/rules.ts:297:46
       for (const p of c.pins) {
         if (p.signal === undefined) continue
         if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Pin ${c.ref}.${p.pin} is assigned signal ${p.signal} but has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
+        if (!wired.has(`${c.ref}:${p.pin}`)) {}
       }
     }
killedBy: HK-CONN-010 unconnectedAssignedPin fires for an assigned, unwired pin; unassigned pins are fine
statusReason: expected [] to deeply equal [ 'connector:J1.pin:1' ]

[Killed] ConditionalExpression
src/rules.ts:297:13
       for (const p of c.pins) {
         if (p.signal === undefined) continue
         if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
-        if (!wired.has(`${c.ref}:${p.pin}`)) {
+        if (true) {
           ctx.report({
             severity: Warn,
killedBy: HK-CONN-010 unconnectedAssignedPin a wire to a splice counts as wiring the pin
statusReason: expected [ { code: 'HK-CONN-010', …(3) } ] to deeply equal []

[Killed] ObjectLiteral
src/rules.ts:298:22
         if (p.signal === undefined) continue
         if (isShieldSignal(p.signal)) continue // covered by shieldDrainUnconnected
         if (!wired.has(`${c.ref}:${p.pin}`)) {
-          ctx.report({
-            severity: Warn,
-            message: `Pin ${c.ref}.${p.pin} is assigned signal ${p.signal} but has no wire connected.`,
-            target: refs.pin(c.ref, p.pin)
-          })
+          ctx.report({})
         }
       }
killedBy: HK-CONN-010 unconnectedAssignedPin fires for an assigned, unwired pin; unassigned pins are fine
statusReason: expected [ undefined ] to deeply equal [ 'connector:J1.pin:1' ]

[Killed] BlockStatement
src/rules.ts:312:12
 
 export const wireSignalMismatch: Rule = rule(
   "wireSignalMismatch",
-  (ctx) => {
-    const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
-    for (const w of ctx.hir.wires) {
-      if (w.signal === undefined) continue
-      for (const end of [w.from, w.to]) {
-        if (!isPinEndpoint(end)) continue
-        const pinSignal = byRef
-          .get(end.connector)
-          ?.pins.find((p) => p.pin === end.pin)?.signal
-        if (pinSignal !== undefined && pinSignal !== w.signal) {
-          ctx.report({
-            severity: Err,
-            message: `Wire ${w.id} carries ${w.signal} but pin ${end.connector}.${end.pin} is assigned ${pinSignal}.`,
-            target: refs.pin(end.connector, end.pin)
-          })
-        }
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-CONN-011" }
 )
killedBy: HK-CONN-011 wireSignalMismatch fires once per mismatched endpoint
statusReason: expected [] to deeply equal [ 'connector:J2.pin:2' ]

[Killed] BlockStatement
src/rules.ts:314:36
   "wireSignalMismatch",
   (ctx) => {
     const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
-    for (const w of ctx.hir.wires) {
-      if (w.signal === undefined) continue
-      for (const end of [w.from, w.to]) {
-        if (!isPinEndpoint(end)) continue
-        const pinSignal = byRef
-          .get(end.connector)
-          ?.pins.find((p) => p.pin === end.pin)?.signal
-        if (pinSignal !== undefined && pinSignal !== w.signal) {
-          ctx.report({
-            severity: Err,
-            message: `Wire ${w.id} carries ${w.signal} but pin ${end.connector}.${end.pin} is assigned ${pinSignal}.`,
-            target: refs.pin(end.connector, end.pin)
-          })
-        }
-      }
-    }
+    for (const w of ctx.hir.wires) {}
   },
   { code: "HK-CONN-011" }
killedBy: HK-CONN-011 wireSignalMismatch fires once per mismatched endpoint
statusReason: expected [] to deeply equal [ 'connector:J2.pin:2' ]

[Killed] ConditionalExpression
src/rules.ts:315:11
   (ctx) => {
     const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
     for (const w of ctx.hir.wires) {
-      if (w.signal === undefined) continue
+      if (true) continue
       for (const end of [w.from, w.to]) {
         if (!isPinEndpoint(end)) continue
killedBy: HK-CONN-011 wireSignalMismatch fires once per mismatched endpoint
statusReason: expected [] to deeply equal [ 'connector:J2.pin:2' ]

[Killed] BlockStatement
src/rules.ts:316:41
     const byRef = new Map(ctx.hir.connectors.map((c) => [c.ref, c]))
     for (const w of ctx.hir.wires) {
       if (w.signal === undefined) continue
-      for (const end of [w.from, w.to]) {
-        if (!isPinEndpoint(end)) continue
-        const pinSignal = byRef
-          .get(end.connector)
-          ?.pins.find((p) => p.pin === end.pin)?.signal
-        if (pinSignal !== undefined && pinSignal !== w.signal) {
-          ctx.report({
-            severity: Err,
-            message: `Wire ${w.id} carries ${w.signal} but pin ${end.connector}.${end.pin} is assigned ${pinSignal}.`,
-            target: refs.pin(end.connector, end.pin)
-          })
-        }
-      }
+      for (const end of [w.from, w.to]) {}
     }
   },
killedBy: HK-CONN-011 wireSignalMismatch fires once per mismatched endpoint
statusReason: expected [] to deeply equal [ 'connector:J2.pin:2' ]

[Killed] OptionalChaining
src/rules.ts:318:27
       if (w.signal === undefined) continue
       for (const end of [w.from, w.to]) {
         if (!isPinEndpoint(end)) continue
-        const pinSignal = byRef
-          .get(end.connector)
-          ?.pins.find((p) => p.pin === end.pin)?.signal
+        const pinSignal = byRef.get(end.connector)?.pins.find(p => p.pin === end.pin).signal
         if (pinSignal !== undefined && pinSignal !== w.signal) {
           ctx.report({
killedBy: HK-CONN-011 wireSignalMismatch passes on matching signals; skips unassigned pins and signalless wires
statusReason: Cannot read properties of undefined (reading 'signal')

[Survived] OptionalChaining
src/rules.ts:318:27
       if (w.signal === undefined) continue
       for (const end of [w.from, w.to]) {
         if (!isPinEndpoint(end)) continue
-        const pinSignal = byRef
-          .get(end.connector)
-          ?.pins.find((p) => p.pin === end.pin)?.signal
+        const pinSignal = byRef.get(end.connector).pins.find((p) => p.pin === end.pin)?.signal
         if (pinSignal !== undefined && pinSignal !== w.signal) {
           ctx.report({

[Killed] ConditionalExpression
src/rules.ts:320:30
         if (!isPinEndpoint(end)) continue
         const pinSignal = byRef
           .get(end.connector)
-          ?.pins.find((p) => p.pin === end.pin)?.signal
+          ?.pins.find((p) => false)?.signal
         if (pinSignal !== undefined && pinSignal !== w.signal) {
           ctx.report({
killedBy: HK-CONN-011 wireSignalMismatch fires once per mismatched endpoint
statusReason: expected [] to deeply equal [ 'connector:J2.pin:2' ]

[Killed] ArrowFunction
src/rules.ts:320:23
         if (!isPinEndpoint(end)) continue
         const pinSignal = byRef
           .get(end.connector)
-          ?.pins.find((p) => p.pin === end.pin)?.signal
+          ?.pins.find(() => undefined)?.signal
         if (pinSignal !== undefined && pinSignal !== w.signal) {
           ctx.report({
killedBy: HK-CONN-011 wireSignalMismatch fires once per mismatched endpoint
statusReason: expected [] to deeply equal [ 'connector:J2.pin:2' ]

[Killed] ConditionalExpression
src/rules.ts:321:13
         const pinSignal = byRef
           .get(end.connector)
           ?.pins.find((p) => p.pin === end.pin)?.signal
-        if (pinSignal !== undefined && pinSignal !== w.signal) {
+        if (true) {
           ctx.report({
             severity: Err,
killedBy: HK-CONN-011 wireSignalMismatch fires once per mismatched endpoint
statusReason: expected [ 'connector:J1.pin:1', …(1) ] to deeply equal [ 'connector:J2.pin:2' ]

[Killed] ConditionalExpression
src/rules.ts:321:13
         const pinSignal = byRef
           .get(end.connector)
           ?.pins.find((p) => p.pin === end.pin)?.signal
-        if (pinSignal !== undefined && pinSignal !== w.signal) {
+        if (true && pinSignal !== w.signal) {
           ctx.report({
             severity: Err,
killedBy: HK-CONN-011 wireSignalMismatch passes on matching signals; skips unassigned pins and signalless wires
statusReason: expected [ { code: 'HK-CONN-011', …(3) }, …(1) ] to deeply equal []

[Killed] StringLiteral
src/rules.ts:331:11
       }
     }
   },
-  { code: "HK-CONN-011" }
+  { code: "" }
 )
 
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 1 tests
{ seed: -1303545333, path: "0:1:1:1:1:1:1:2:2:2:2:2:2:2:2:3:2:2:3:3:3:3:3:3:4:4:3:3:3:4:4:4:4", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{"1":"A"},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "p

[Killed] ObjectLiteral
src/rules.ts:331:3
       }
     }
   },
-  { code: "HK-CONN-011" }
+  {}
 )
 
killedBy: rule engine invariants (property-based) never throws and always emits well-formed diagnostics
statusReason: Property failed after 1 tests
{ seed: 795837995, path: "0:0:0:0:0:1:1:1:2:1:1:2:2:2:2:2:2:3:3:3:3:3:3:3", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{"1":"A"},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      conne

[Killed] BlockStatement
src/rules.ts:338:12
 
 export const terminalIncompatible: Rule = rule(
   "terminalIncompatible",
-  (ctx) => {
-    for (const c of ctx.hir.connectors) {
-      if (c.compatibleTerminals === undefined) continue
-      for (const p of c.pins) {
-        if (p.terminal !== undefined && !c.compatibleTerminals.includes(p.terminal)) {
-          ctx.report({
-            severity: Err,
-            message: `Pin ${c.ref}.${p.pin} uses terminal ${p.terminal}, which is not compatible with ${c.mpn} (allowed: ${c.compatibleTerminals.join(", ")}).`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-CONN-012" }
 )
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-012: terminal not in the part's compatible list
statusReason: expected [] to deeply equal [ 'HK-CONN-012', 'HK-CONN-012', …(2) ]

[Killed] BlockStatement
src/rules.ts:339:41
 export const terminalIncompatible: Rule = rule(
   "terminalIncompatible",
   (ctx) => {
-    for (const c of ctx.hir.connectors) {
-      if (c.compatibleTerminals === undefined) continue
-      for (const p of c.pins) {
-        if (p.terminal !== undefined && !c.compatibleTerminals.includes(p.terminal)) {
-          ctx.report({
-            severity: Err,
-            message: `Pin ${c.ref}.${p.pin} uses terminal ${p.terminal}, which is not compatible with ${c.mpn} (allowed: ${c.compatibleTerminals.join(", ")}).`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
+    for (const c of ctx.hir.connectors) {}
   },
   { code: "HK-CONN-012" }
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-012: terminal not in the part's compatible list
statusReason: expected [] to deeply equal [ 'HK-CONN-012', 'HK-CONN-012', …(2) ]
