[Killed] EqualityOperator
src/rules.ts:340:11
   "terminalIncompatible",
   (ctx) => {
     for (const c of ctx.hir.connectors) {
-      if (c.compatibleTerminals === undefined) continue
+      if (c.compatibleTerminals !== undefined) continue
       for (const p of c.pins) {
         if (p.terminal !== undefined && !c.compatibleTerminals.includes(p.terminal)) {
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-012: terminal not in the part's compatible list
statusReason: expected [] to deeply equal [ 'HK-CONN-012', 'HK-CONN-012', …(2) ]

[Killed] ConditionalExpression
src/rules.ts:340:11
   "terminalIncompatible",
   (ctx) => {
     for (const c of ctx.hir.connectors) {
-      if (c.compatibleTerminals === undefined) continue
+      if (true) continue
       for (const p of c.pins) {
         if (p.terminal !== undefined && !c.compatibleTerminals.includes(p.terminal)) {
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-012: terminal not in the part's compatible list
statusReason: expected [] to deeply equal [ 'HK-CONN-012', 'HK-CONN-012', …(2) ]

[Killed] BlockStatement
src/rules.ts:341:31
   (ctx) => {
     for (const c of ctx.hir.connectors) {
       if (c.compatibleTerminals === undefined) continue
-      for (const p of c.pins) {
-        if (p.terminal !== undefined && !c.compatibleTerminals.includes(p.terminal)) {
-          ctx.report({
-            severity: Err,
-            message: `Pin ${c.ref}.${p.pin} uses terminal ${p.terminal}, which is not compatible with ${c.mpn} (allowed: ${c.compatibleTerminals.join(", ")}).`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
+      for (const p of c.pins) {}
     }
   },
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-012: terminal not in the part's compatible list
statusReason: expected [] to deeply equal [ 'HK-CONN-012', 'HK-CONN-012', …(2) ]

[Killed] ConditionalExpression
src/rules.ts:342:13
     for (const c of ctx.hir.connectors) {
       if (c.compatibleTerminals === undefined) continue
       for (const p of c.pins) {
-        if (p.terminal !== undefined && !c.compatibleTerminals.includes(p.terminal)) {
+        if (false) {
           ctx.report({
             severity: Err,
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-012: terminal not in the part's compatible list
statusReason: expected [] to deeply equal [ 'HK-CONN-012', 'HK-CONN-012', …(2) ]

[Killed] ConditionalExpression
src/rules.ts:342:13
     for (const c of ctx.hir.connectors) {
       if (c.compatibleTerminals === undefined) continue
       for (const p of c.pins) {
-        if (p.terminal !== undefined && !c.compatibleTerminals.includes(p.terminal)) {
+        if (true) {
           ctx.report({
             severity: Err,
killedBy: per-pin terminals and seals (PRD §30) a fully sealed, compatible assignment passes all built-ins
statusReason: expected [ { code: 'HK-CONN-012', …(3) }, …(3) ] to deeply equal []

[Killed] StringLiteral
src/rules.ts:352:11
       }
     }
   },
-  { code: "HK-CONN-012" }
+  { code: "" }
 )
 
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-012: terminal not in the part's compatible list
statusReason: expected [ '', '', '', '' ] to deeply equal [ 'HK-CONN-012', 'HK-CONN-012', …(2) ]

[Killed] BlockStatement
src/rules.ts:357:12
 
 export const missingSeal: Rule = rule(
   "missingSeal",
-  (ctx) => {
-    const wired = wiredPins(ctx.hir)
-    for (const c of ctx.hir.connectors) {
-      if (c.sealed !== true) continue
-      for (const p of c.pins) {
-        if (wired.has(`${c.ref}:${p.pin}`) && p.seal === undefined) {
-          ctx.report({
-            severity: Err,
-            message: `Connector ${c.ref} (${c.mpn}) is sealed, but populated pin ${p.pin} has no seal assigned.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-CONN-013" }
 )
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-013: sealed connector with unsealed populated pin
statusReason: expected [] to have a length of 4 but got +0

[Killed] BlockStatement
src/rules.ts:359:41
   "missingSeal",
   (ctx) => {
     const wired = wiredPins(ctx.hir)
-    for (const c of ctx.hir.connectors) {
-      if (c.sealed !== true) continue
-      for (const p of c.pins) {
-        if (wired.has(`${c.ref}:${p.pin}`) && p.seal === undefined) {
-          ctx.report({
-            severity: Err,
-            message: `Connector ${c.ref} (${c.mpn}) is sealed, but populated pin ${p.pin} has no seal assigned.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
+    for (const c of ctx.hir.connectors) {}
   },
   { code: "HK-CONN-013" }
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-013: sealed connector with unsealed populated pin
statusReason: expected [] to have a length of 4 but got +0

[Killed] ConditionalExpression
src/rules.ts:360:11
   (ctx) => {
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
-      if (c.sealed !== true) continue
+      if (true) continue
       for (const p of c.pins) {
         if (wired.has(`${c.ref}:${p.pin}`) && p.seal === undefined) {
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-013: sealed connector with unsealed populated pin
statusReason: expected [] to have a length of 4 but got +0

[Killed] EqualityOperator
src/rules.ts:360:11
   (ctx) => {
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
-      if (c.sealed !== true) continue
+      if (c.sealed === true) continue
       for (const p of c.pins) {
         if (wired.has(`${c.ref}:${p.pin}`) && p.seal === undefined) {
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-013: sealed connector with unsealed populated pin
statusReason: expected [] to have a length of 4 but got +0

[Killed] BlockStatement
src/rules.ts:361:31
     const wired = wiredPins(ctx.hir)
     for (const c of ctx.hir.connectors) {
       if (c.sealed !== true) continue
-      for (const p of c.pins) {
-        if (wired.has(`${c.ref}:${p.pin}`) && p.seal === undefined) {
-          ctx.report({
-            severity: Err,
-            message: `Connector ${c.ref} (${c.mpn}) is sealed, but populated pin ${p.pin} has no seal assigned.`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
+      for (const p of c.pins) {}
     }
   },
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-013: sealed connector with unsealed populated pin
statusReason: expected [] to have a length of 4 but got +0

[Killed] ConditionalExpression
src/rules.ts:362:13
     for (const c of ctx.hir.connectors) {
       if (c.sealed !== true) continue
       for (const p of c.pins) {
-        if (wired.has(`${c.ref}:${p.pin}`) && p.seal === undefined) {
+        if (true) {
           ctx.report({
             severity: Err,
killedBy: per-pin terminals and seals (PRD §30) a fully sealed, compatible assignment passes all built-ins
statusReason: expected [ { code: 'HK-CONN-013', …(3) }, …(3) ] to deeply equal []

[Killed] ConditionalExpression
src/rules.ts:362:47
     for (const c of ctx.hir.connectors) {
       if (c.sealed !== true) continue
       for (const p of c.pins) {
-        if (wired.has(`${c.ref}:${p.pin}`) && p.seal === undefined) {
+        if (wired.has(`${c.ref}:${p.pin}`) && true) {
           ctx.report({
             severity: Err,
killedBy: per-pin terminals and seals (PRD §30) a fully sealed, compatible assignment passes all built-ins
statusReason: expected [ { code: 'HK-CONN-013', …(3) }, …(3) ] to deeply equal []

[Killed] ObjectLiteral
src/rules.ts:372:3
       }
     }
   },
-  { code: "HK-CONN-013" }
+  {}
 )
 
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-013: sealed connector with unsealed populated pin
statusReason: expected 'HK-RULE-MISSINGSEAL' to be 'HK-CONN-013' // Object.is equality

[Killed] BlockStatement
src/rules.ts:377:12
 
 export const sealIncompatible: Rule = rule(
   "sealIncompatible",
-  (ctx) => {
-    for (const c of ctx.hir.connectors) {
-      if (c.compatibleSeals === undefined) continue
-      for (const p of c.pins) {
-        if (p.seal !== undefined && !c.compatibleSeals.includes(p.seal)) {
-          ctx.report({
-            severity: Err,
-            message: `Pin ${c.ref}.${p.pin} uses seal ${p.seal}, which is not compatible with ${c.mpn} (allowed: ${c.compatibleSeals.join(", ")}).`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
-  },
+  (ctx) => {},
   { code: "HK-CONN-014" }
 )
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-014: seal not in the part's compatible list
statusReason: expected undefined to be 'HK-CONN-014' // Object.is equality

[Killed] BlockStatement
src/rules.ts:378:41
 export const sealIncompatible: Rule = rule(
   "sealIncompatible",
   (ctx) => {
-    for (const c of ctx.hir.connectors) {
-      if (c.compatibleSeals === undefined) continue
-      for (const p of c.pins) {
-        if (p.seal !== undefined && !c.compatibleSeals.includes(p.seal)) {
-          ctx.report({
-            severity: Err,
-            message: `Pin ${c.ref}.${p.pin} uses seal ${p.seal}, which is not compatible with ${c.mpn} (allowed: ${c.compatibleSeals.join(", ")}).`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
-    }
+    for (const c of ctx.hir.connectors) {}
   },
   { code: "HK-CONN-014" }
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-014: seal not in the part's compatible list
statusReason: expected undefined to be 'HK-CONN-014' // Object.is equality

[Killed] ConditionalExpression
src/rules.ts:379:11
   "sealIncompatible",
   (ctx) => {
     for (const c of ctx.hir.connectors) {
-      if (c.compatibleSeals === undefined) continue
+      if (true) continue
       for (const p of c.pins) {
         if (p.seal !== undefined && !c.compatibleSeals.includes(p.seal)) {
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-014: seal not in the part's compatible list
statusReason: expected undefined to be 'HK-CONN-014' // Object.is equality

[Killed] EqualityOperator
src/rules.ts:379:11
   "sealIncompatible",
   (ctx) => {
     for (const c of ctx.hir.connectors) {
-      if (c.compatibleSeals === undefined) continue
+      if (c.compatibleSeals !== undefined) continue
       for (const p of c.pins) {
         if (p.seal !== undefined && !c.compatibleSeals.includes(p.seal)) {
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-014: seal not in the part's compatible list
statusReason: expected undefined to be 'HK-CONN-014' // Object.is equality

[Killed] BlockStatement
src/rules.ts:380:31
   (ctx) => {
     for (const c of ctx.hir.connectors) {
       if (c.compatibleSeals === undefined) continue
-      for (const p of c.pins) {
-        if (p.seal !== undefined && !c.compatibleSeals.includes(p.seal)) {
-          ctx.report({
-            severity: Err,
-            message: `Pin ${c.ref}.${p.pin} uses seal ${p.seal}, which is not compatible with ${c.mpn} (allowed: ${c.compatibleSeals.join(", ")}).`,
-            target: refs.pin(c.ref, p.pin)
-          })
-        }
-      }
+      for (const p of c.pins) {}
     }
   },
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-014: seal not in the part's compatible list
statusReason: expected undefined to be 'HK-CONN-014' // Object.is equality

[Killed] LogicalOperator
src/rules.ts:381:13
     for (const c of ctx.hir.connectors) {
       if (c.compatibleSeals === undefined) continue
       for (const p of c.pins) {
-        if (p.seal !== undefined && !c.compatibleSeals.includes(p.seal)) {
+        if (p.seal !== undefined || !c.compatibleSeals.includes(p.seal)) {
           ctx.report({
             severity: Err,
killedBy: per-pin terminals and seals (PRD §30) a fully sealed, compatible assignment passes all built-ins
statusReason: expected [ { code: 'HK-CONN-014', …(3) }, …(3) ] to deeply equal []

[Killed] ConditionalExpression
src/rules.ts:381:13
     for (const c of ctx.hir.connectors) {
       if (c.compatibleSeals === undefined) continue
       for (const p of c.pins) {
-        if (p.seal !== undefined && !c.compatibleSeals.includes(p.seal)) {
+        if (false) {
           ctx.report({
             severity: Err,
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-014: seal not in the part's compatible list
statusReason: expected undefined to be 'HK-CONN-014' // Object.is equality

[Killed] ObjectLiteral
src/rules.ts:391:3
       }
     }
   },
-  { code: "HK-CONN-014" }
+  {}
 )
 
killedBy: per-pin terminals and seals (PRD §30) HK-CONN-014: seal not in the part's compatible list
statusReason: expected 'HK-RULE-SEALINCOMPATIBLE' to be 'HK-CONN-014' // Object.is equality

[Killed] BlockStatement
src/rules.ts:399:84
  * state without mutating library data). Pass the approved MPN list from
  * org config; anything else in the BOM is flagged.
  */
-export const requireApprovedParts = (approvedMpns: ReadonlyArray<string>): Rule => {
-  const approved = new Set(approvedMpns)
-  return rule(
-    "requireApprovedParts",
-    (ctx) => {
-      for (const item of ctx.hir.bom) {
-        if (!approved.has(item.mpn)) {
-          ctx.report({
-            severity: Warn,
-            message: `Part ${item.mpn} (${item.category ?? "part"}) is not on the approved parts list.`,
-            target: refs.bom(item.mpn)
-          })
-        }
-      }
-    },
-    { code: "HK-DOC-004" }
-  )
-}
+export const requireApprovedParts = (approvedMpns: ReadonlyArray<string>): Rule => {}
 
 /** All built-in rules, in stable order. */
killedBy: approvals and provenance (PRD §30 acceptance) requireApprovedParts flags BOM items off the org list without mutating library data
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/rules.ts:403:14
   const approved = new Set(approvedMpns)
   return rule(
     "requireApprovedParts",
-    (ctx) => {
-      for (const item of ctx.hir.bom) {
-        if (!approved.has(item.mpn)) {
-          ctx.report({
-            severity: Warn,
-            message: `Part ${item.mpn} (${item.category ?? "part"}) is not on the approved parts list.`,
-            target: refs.bom(item.mpn)
-          })
-        }
-      }
-    },
+    (ctx) => {},
     { code: "HK-DOC-004" }
   )
killedBy: approvals and provenance (PRD §30 acceptance) requireApprovedParts flags BOM items off the org list without mutating library data
statusReason: expected [] to deeply equal [ 'bom:S-100' ]

[Killed] BlockStatement
src/rules.ts:404:39
   return rule(
     "requireApprovedParts",
     (ctx) => {
-      for (const item of ctx.hir.bom) {
-        if (!approved.has(item.mpn)) {
-          ctx.report({
-            severity: Warn,
-            message: `Part ${item.mpn} (${item.category ?? "part"}) is not on the approved parts list.`,
-            target: refs.bom(item.mpn)
-          })
-        }
-      }
+      for (const item of ctx.hir.bom) {}
     },
     { code: "HK-DOC-004" }
killedBy: approvals and provenance (PRD §30 acceptance) requireApprovedParts flags BOM items off the org list without mutating library data
statusReason: expected [] to deeply equal [ 'bom:S-100' ]

[Killed] BooleanLiteral
src/rules.ts:405:13
     "requireApprovedParts",
     (ctx) => {
       for (const item of ctx.hir.bom) {
-        if (!approved.has(item.mpn)) {
+        if (approved.has(item.mpn)) {
           ctx.report({
             severity: Warn,
killedBy: approvals and provenance (PRD §30 acceptance) requireApprovedParts flags BOM items off the org list without mutating library data
statusReason: expected [ 'bom:SEALED-2', 'bom:T-100' ] to deeply equal [ 'bom:S-100' ]

[Killed] BlockStatement
src/rules.ts:405:38
     "requireApprovedParts",
     (ctx) => {
       for (const item of ctx.hir.bom) {
-        if (!approved.has(item.mpn)) {
-          ctx.report({
-            severity: Warn,
-            message: `Part ${item.mpn} (${item.category ?? "part"}) is not on the approved parts list.`,
-            target: refs.bom(item.mpn)
-          })
-        }
+        if (!approved.has(item.mpn)) {}
       }
     },
killedBy: approvals and provenance (PRD §30 acceptance) requireApprovedParts flags BOM items off the org list without mutating library data
statusReason: expected [] to deeply equal [ 'bom:S-100' ]

[Survived] LogicalOperator
src/rules.ts:408:43
         if (!approved.has(item.mpn)) {
           ctx.report({
             severity: Warn,
-            message: `Part ${item.mpn} (${item.category ?? "part"}) is not on the approved parts list.`,
+            message: `Part ${item.mpn} (${item.category && "part"}) is not on the approved parts list.`,
             target: refs.bom(item.mpn)
           })

[NoCoverage] StringLiteral
src/rules.ts:408:60
         if (!approved.has(item.mpn)) {
           ctx.report({
             severity: Warn,
-            message: `Part ${item.mpn} (${item.category ?? "part"}) is not on the approved parts list.`,
+            message: `Part ${item.mpn} (${item.category ?? ""}) is not on the approved parts list.`,
             target: refs.bom(item.mpn)
           })

[Killed] ObjectLiteral
src/rules.ts:414:5
         }
       }
     },
-    { code: "HK-DOC-004" }
+    {}
   )
 }
killedBy: approvals and provenance (PRD §30 acceptance) requireApprovedParts flags BOM items off the org list without mutating library data
statusReason: expected 'HK-RULE-REQUIREAPPROVEDPARTS' to be 'HK-DOC-004' // Object.is equality
