[Killed] Regex
src/code-numbers.ts:28:22
 
 export type RuleCategory = keyof typeof RULE_CATEGORY_BANDS
 
-const CODE_PATTERN = /^HK-(DOC|MFG|WIRE|ELEC|CONN)-(\d{3})$/
+const CODE_PATTERN = /^HK-(DOC|MFG|WIRE|ELEC|CONN)-(\D{3})$/
 
 /** `"HK-CONN-011"` → `5011`. Undefined for non-HK codes. */
killedBy: rule code numbers round-trips every built-in rule code
statusReason: HK-DOC-001: expected undefined to be defined

[Killed] BlockStatement
src/code-numbers.ts:31:69
 const CODE_PATTERN = /^HK-(DOC|MFG|WIRE|ELEC|CONN)-(\d{3})$/
 
 /** `"HK-CONN-011"` → `5011`. Undefined for non-HK codes. */
-export const ruleCodeNumber = (code: string): number | undefined => {
-  const m = CODE_PATTERN.exec(code)
-  if (m === null) return undefined
-  return RULE_CATEGORY_BANDS[m[1] as RuleCategory] + Number(m[2])
-}
+export const ruleCodeNumber = (code: string): number | undefined => {}
 
 /** `5011` → `"HK-CONN-011"`. Undefined for numbers outside the bands. */
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: -1543268717, path: "0:0:0:0:0:0:0:0:1:0:0:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] ConditionalExpression
src/code-numbers.ts:33:7
 /** `"HK-CONN-011"` → `5011`. Undefined for non-HK codes. */
 export const ruleCodeNumber = (code: string): number | undefined => {
   const m = CODE_PATTERN.exec(code)
-  if (m === null) return undefined
+  if (true) return undefined
   return RULE_CATEGORY_BANDS[m[1] as RuleCategory] + Number(m[2])
 }
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: 634383892, path: "0:0:0:0:0:0:0:0:1:0:0:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] EqualityOperator
src/code-numbers.ts:33:7
 /** `"HK-CONN-011"` → `5011`. Undefined for non-HK codes. */
 export const ruleCodeNumber = (code: string): number | undefined => {
   const m = CODE_PATTERN.exec(code)
-  if (m === null) return undefined
+  if (m !== null) return undefined
   return RULE_CATEGORY_BANDS[m[1] as RuleCategory] + Number(m[2])
 }
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: 382307117, path: "0:0:0:0:0:0:0:1:0:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,
      pi

[Killed] ArithmeticOperator
src/code-numbers.ts:34:10
 export const ruleCodeNumber = (code: string): number | undefined => {
   const m = CODE_PATTERN.exec(code)
   if (m === null) return undefined
-  return RULE_CATEGORY_BANDS[m[1] as RuleCategory] + Number(m[2])
+  return RULE_CATEGORY_BANDS[m[1] as RuleCategory] - Number(m[2])
 }
 
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: 1888951901, path: "0:0:0:0:0:0:0:0:1:0:0:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] BlockStatement
src/code-numbers.ts:38:70
 }
 
 /** `5011` → `"HK-CONN-011"`. Undefined for numbers outside the bands. */
-export const ruleCodeFromNumber = (n: number): string | undefined => {
-  if (!Number.isInteger(n)) return undefined
-  const band = Math.floor(n / 1000) * 1000
-  const suffix = n - band
-  if (suffix < 1 || suffix > 999) return undefined
-  const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
-    readonly [RuleCategory, number]
-  >).find(([, b]) => b === band)?.[0]
-  if (category === undefined) return undefined
-  return `HK-${category}-${String(suffix).padStart(3, "0")}`
-}
+export const ruleCodeFromNumber = (n: number): string | undefined => {}
 
 /** Category of a code (or its number): `"HK-MFG-004"` / `2004` → `"MFG"`. */
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: 150794240, path: "0:0:0:0:0:0:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{"1":"A"},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,
      pin: String(p

[Killed] ConditionalExpression
src/code-numbers.ts:39:7
 
 /** `5011` → `"HK-CONN-011"`. Undefined for numbers outside the bands. */
 export const ruleCodeFromNumber = (n: number): string | undefined => {
-  if (!Number.isInteger(n)) return undefined
+  if (true) return undefined
   const band = Math.floor(n / 1000) * 1000
   const suffix = n - band
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: -1316778813, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,
      pin: String(pin)

[Killed] ConditionalExpression
src/code-numbers.ts:39:7
 
 /** `5011` → `"HK-CONN-011"`. Undefined for numbers outside the bands. */
 export const ruleCodeFromNumber = (n: number): string | undefined => {
-  if (!Number.isInteger(n)) return undefined
+  if (false) return undefined
   const band = Math.floor(n / 1000) * 1000
   const suffix = n - band
killedBy: rule code numbers custom and malformed codes return undefined (strings stay the contract)
statusReason: expected 'HK-MFG-4.5' to be undefined

[Killed] ArithmeticOperator
src/code-numbers.ts:40:16
 /** `5011` → `"HK-CONN-011"`. Undefined for numbers outside the bands. */
 export const ruleCodeFromNumber = (n: number): string | undefined => {
   if (!Number.isInteger(n)) return undefined
-  const band = Math.floor(n / 1000) * 1000
+  const band = Math.floor(n / 1000) / 1000
   const suffix = n - band
   if (suffix < 1 || suffix > 999) return undefined
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: -1568581631, path: "0:0:0:0:0:0:0:0:1:0:1:1:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref

[Killed] ArithmeticOperator
src/code-numbers.ts:40:27
 /** `5011` → `"HK-CONN-011"`. Undefined for numbers outside the bands. */
 export const ruleCodeFromNumber = (n: number): string | undefined => {
   if (!Number.isInteger(n)) return undefined
-  const band = Math.floor(n / 1000) * 1000
+  const band = Math.floor(n * 1000) * 1000
   const suffix = n - band
   if (suffix < 1 || suffix > 999) return undefined
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: 2116877827, path: "0:1:0:1:1:1:1:1:1:2:1:2:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{"1":"A"},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] ArithmeticOperator
src/code-numbers.ts:41:18
 export const ruleCodeFromNumber = (n: number): string | undefined => {
   if (!Number.isInteger(n)) return undefined
   const band = Math.floor(n / 1000) * 1000
-  const suffix = n - band
+  const suffix = n + band
   if (suffix < 1 || suffix > 999) return undefined
   const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: -695310715, path: "0:0:0:0:0:0:0:0:1:1:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,

[Killed] EqualityOperator
src/code-numbers.ts:42:7
   if (!Number.isInteger(n)) return undefined
   const band = Math.floor(n / 1000) * 1000
   const suffix = n - band
-  if (suffix < 1 || suffix > 999) return undefined
+  if (suffix >= 1 || suffix > 999) return undefined
   const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: -302009585, path: "0:0:0:0:0:0:0:1:0:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,
      p

[Killed] LogicalOperator
src/code-numbers.ts:42:7
   if (!Number.isInteger(n)) return undefined
   const band = Math.floor(n / 1000) * 1000
   const suffix = n - band
-  if (suffix < 1 || suffix > 999) return undefined
+  if (suffix < 1 && suffix > 999) return undefined
   const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
killedBy: rule code numbers custom and malformed codes return undefined (strings stay the contract)
statusReason: expected 'HK-DOC-000' to be undefined

[Killed] OptionalChaining
src/code-numbers.ts:43:20
   const band = Math.floor(n / 1000) * 1000
   const suffix = n - band
   if (suffix < 1 || suffix > 999) return undefined
-  const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
-    readonly [RuleCategory, number]
-  >).find(([, b]) => b === band)?.[0]
+  const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<readonly [RuleCategory, number]>).find(([, b]) => b === band)[0]
   if (category === undefined) return undefined
   return `HK-${category}-${String(suffix).padStart(3, "0")}`
killedBy: rule code numbers custom and malformed codes return undefined (strings stay the contract)
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/code-numbers.ts:45:22
   if (suffix < 1 || suffix > 999) return undefined
   const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
-  >).find(([, b]) => b === band)?.[0]
+  >).find(([, b]) => b !== band)?.[0]
   if (category === undefined) return undefined
   return `HK-${category}-${String(suffix).padStart(3, "0")}`
killedBy: rule code numbers round-trips every built-in rule code
statusReason: HK-DOC-001: expected 'HK-MFG-001' to be 'HK-DOC-001' // Object.is equality

[Killed] ConditionalExpression
src/code-numbers.ts:45:22
   if (suffix < 1 || suffix > 999) return undefined
   const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
-  >).find(([, b]) => b === band)?.[0]
+  >).find(([, b]) => false)?.[0]
   if (category === undefined) return undefined
   return `HK-${category}-${String(suffix).padStart(3, "0")}`
killedBy: rule engine invariants (property-based) every emitted code round-trips through the numeric mapping
statusReason: Property failed after 1 tests
{ seed: 1390742468, path: "0:0:0:0:0:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"kind":"harness","id":"prop-fixture","revision":"A","units":"mm","metadata":{},"connectors":[{"kind":"connector","ref":"J1","part":{"mpn":"AA-00","pinCount":1},"pins":{},"terminals":{},"seals":{},"pin":(pin) => ({
      kind: "pin-ref",
      connector: ref,
      pin: St

[Killed] EqualityOperator
src/code-numbers.ts:46:7
   const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
   >).find(([, b]) => b === band)?.[0]
-  if (category === undefined) return undefined
+  if (category !== undefined) return undefined
   return `HK-${category}-${String(suffix).padStart(3, "0")}`
 }
killedBy: rule code numbers round-trips every built-in rule code
statusReason: HK-DOC-001: expected undefined to be 'HK-DOC-001' // Object.is equality

[Killed] ConditionalExpression
src/code-numbers.ts:46:7
   const category = (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
   >).find(([, b]) => b === band)?.[0]
-  if (category === undefined) return undefined
+  if (true) return undefined
   return `HK-${category}-${String(suffix).padStart(3, "0")}`
 }
killedBy: rule code numbers round-trips every built-in rule code
statusReason: HK-DOC-001: expected undefined to be 'HK-DOC-001' // Object.is equality

[Killed] StringLiteral
src/code-numbers.ts:47:55
     readonly [RuleCategory, number]
   >).find(([, b]) => b === band)?.[0]
   if (category === undefined) return undefined
-  return `HK-${category}-${String(suffix).padStart(3, "0")}`
+  return `HK-${category}-${String(suffix).padStart(3, "")}`
 }
 
killedBy: rule code numbers round-trips every built-in rule code
statusReason: HK-DOC-001: expected 'HK-DOC-1' to be 'HK-DOC-001' // Object.is equality

[Killed] BlockStatement
src/code-numbers.ts:51:82
 }
 
 /** Category of a code (or its number): `"HK-MFG-004"` / `2004` → `"MFG"`. */
-export const ruleCategory = (code: string | number): RuleCategory | undefined => {
-  const n = typeof code === "number" ? code : ruleCodeNumber(code)
-  if (n === undefined) return undefined
-  const band = Math.floor(n / 1000) * 1000
-  return (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
-    readonly [RuleCategory, number]
-  >).find(([, b]) => b === band)?.[0]
-}
+export const ruleCategory = (code: string | number): RuleCategory | undefined => {}
 
 /** Compact set of fired rules for telemetry / waiver storage. */
killedBy: rule code numbers category math works from either representation
statusReason: expected undefined to be 'ELEC' // Object.is equality

[Killed] ConditionalExpression
src/code-numbers.ts:52:13
 
 /** Category of a code (or its number): `"HK-MFG-004"` / `2004` → `"MFG"`. */
 export const ruleCategory = (code: string | number): RuleCategory | undefined => {
-  const n = typeof code === "number" ? code : ruleCodeNumber(code)
+  const n = false ? code : ruleCodeNumber(code)
   if (n === undefined) return undefined
   const band = Math.floor(n / 1000) * 1000
killedBy: rule code numbers category math works from either representation
statusReason: expected undefined to be 'CONN' // Object.is equality

[Killed] ConditionalExpression
src/code-numbers.ts:52:13
 
 /** Category of a code (or its number): `"HK-MFG-004"` / `2004` → `"MFG"`. */
 export const ruleCategory = (code: string | number): RuleCategory | undefined => {
-  const n = typeof code === "number" ? code : ruleCodeNumber(code)
+  const n = true ? code : ruleCodeNumber(code)
   if (n === undefined) return undefined
   const band = Math.floor(n / 1000) * 1000
killedBy: rule code numbers category math works from either representation
statusReason: expected undefined to be 'ELEC' // Object.is equality

[Killed] EqualityOperator
src/code-numbers.ts:53:7
 /** Category of a code (or its number): `"HK-MFG-004"` / `2004` → `"MFG"`. */
 export const ruleCategory = (code: string | number): RuleCategory | undefined => {
   const n = typeof code === "number" ? code : ruleCodeNumber(code)
-  if (n === undefined) return undefined
+  if (n !== undefined) return undefined
   const band = Math.floor(n / 1000) * 1000
   return (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
killedBy: rule code numbers category math works from either representation
statusReason: expected undefined to be 'ELEC' // Object.is equality

[Killed] ConditionalExpression
src/code-numbers.ts:53:7
 /** Category of a code (or its number): `"HK-MFG-004"` / `2004` → `"MFG"`. */
 export const ruleCategory = (code: string | number): RuleCategory | undefined => {
   const n = typeof code === "number" ? code : ruleCodeNumber(code)
-  if (n === undefined) return undefined
+  if (true) return undefined
   const band = Math.floor(n / 1000) * 1000
   return (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
killedBy: rule code numbers category math works from either representation
statusReason: expected undefined to be 'ELEC' // Object.is equality

[Killed] ArithmeticOperator
src/code-numbers.ts:54:27
 export const ruleCategory = (code: string | number): RuleCategory | undefined => {
   const n = typeof code === "number" ? code : ruleCodeNumber(code)
   if (n === undefined) return undefined
-  const band = Math.floor(n / 1000) * 1000
+  const band = Math.floor(n * 1000) * 1000
   return (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
killedBy: rule code numbers category math works from either representation
statusReason: expected undefined to be 'ELEC' // Object.is equality

[Killed] ArithmeticOperator
src/code-numbers.ts:54:16
 export const ruleCategory = (code: string | number): RuleCategory | undefined => {
   const n = typeof code === "number" ? code : ruleCodeNumber(code)
   if (n === undefined) return undefined
-  const band = Math.floor(n / 1000) * 1000
+  const band = Math.floor(n / 1000) / 1000
   return (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
killedBy: rule code numbers category math works from either representation
statusReason: expected undefined to be 'ELEC' // Object.is equality

[Survived] OptionalChaining
src/code-numbers.ts:55:10
   const n = typeof code === "number" ? code : ruleCodeNumber(code)
   if (n === undefined) return undefined
   const band = Math.floor(n / 1000) * 1000
-  return (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
-    readonly [RuleCategory, number]
-  >).find(([, b]) => b === band)?.[0]
+  return (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<readonly [RuleCategory, number]>).find(([, b]) => b === band)[0]
 }
 

[Killed] ArrowFunction
src/code-numbers.ts:57:11
   const band = Math.floor(n / 1000) * 1000
   return (Object.entries(RULE_CATEGORY_BANDS) as ReadonlyArray<
     readonly [RuleCategory, number]
-  >).find(([, b]) => b === band)?.[0]
+  >).find(() => undefined)?.[0]
 }
 
killedBy: rule code numbers category math works from either representation
statusReason: expected undefined to be 'ELEC' // Object.is equality

[Killed] ArrowFunction
src/code-numbers.ts:61:31
 }
 
 /** Compact set of fired rules for telemetry / waiver storage. */
-export const codesToNumbers = (codes: ReadonlyArray<string>): ReadonlyArray<number> =>
-  [...new Set(codes.map(ruleCodeNumber).filter((n): n is number => n !== undefined))].sort(
-    (a, b) => a - b
-  )
+export const codesToNumbers = () => undefined
 
killedBy: rule code numbers codesToNumbers dedupes, sorts, and drops custom codes
statusReason: expected undefined to deeply equal [ 1001, 5011 ]

[Killed] MethodExpression
src/code-numbers.ts:62:15
 
 /** Compact set of fired rules for telemetry / waiver storage. */
 export const codesToNumbers = (codes: ReadonlyArray<string>): ReadonlyArray<number> =>
-  [...new Set(codes.map(ruleCodeNumber).filter((n): n is number => n !== undefined))].sort(
+  [...new Set(codes.map(ruleCodeNumber))].sort(
     (a, b) => a - b
   )
killedBy: rule code numbers codesToNumbers dedupes, sorts, and drops custom codes
statusReason: expected [ 1001, 5011, undefined ] to deeply equal [ 1001, 5011 ]

[Killed] ConditionalExpression
src/code-numbers.ts:62:68
 
 /** Compact set of fired rules for telemetry / waiver storage. */
 export const codesToNumbers = (codes: ReadonlyArray<string>): ReadonlyArray<number> =>
-  [...new Set(codes.map(ruleCodeNumber).filter((n): n is number => n !== undefined))].sort(
+  [...new Set(codes.map(ruleCodeNumber).filter((n): n is number => false))].sort(
     (a, b) => a - b
   )
killedBy: rule code numbers codesToNumbers dedupes, sorts, and drops custom codes
statusReason: expected [] to deeply equal [ 1001, 5011 ]

[Killed] ArrowFunction
src/code-numbers.ts:63:5
 /** Compact set of fired rules for telemetry / waiver storage. */
 export const codesToNumbers = (codes: ReadonlyArray<string>): ReadonlyArray<number> =>
   [...new Set(codes.map(ruleCodeNumber).filter((n): n is number => n !== undefined))].sort(
-    (a, b) => a - b
+    () => undefined
   )
 
killedBy: rule code numbers codesToNumbers dedupes, sorts, and drops custom codes
statusReason: expected [ 5011, 1001 ] to deeply equal [ 1001, 5011 ]

[Killed] ArithmeticOperator
src/code-numbers.ts:63:15
 /** Compact set of fired rules for telemetry / waiver storage. */
 export const codesToNumbers = (codes: ReadonlyArray<string>): ReadonlyArray<number> =>
   [...new Set(codes.map(ruleCodeNumber).filter((n): n is number => n !== undefined))].sort(
-    (a, b) => a - b
+    (a, b) => a + b
   )
 
killedBy: rule code numbers codesToNumbers dedupes, sorts, and drops custom codes
statusReason: expected [ 5011, 1001 ] to deeply equal [ 1001, 5011 ]
