[Killed] BlockStatement
src/wire-data.ts:10:64
  */
 
 /** Parse "18AWG" / "18 AWG" / "awg18" → 18. */
-export const parseAwg = (gauge: string): number | undefined => {
-  const match = /(\d+)\s*AWG|AWG\s*(\d+)/i.exec(gauge.trim())
-  const raw = match?.[1] ?? match?.[2]
-  if (raw === undefined) return undefined
-  const n = Number(raw)
-  return Number.isInteger(n) && n > 0 ? n : undefined
-}
+export const parseAwg = (gauge: string): number | undefined => {}
 
 /** Max continuous current (A) per AWG, bundled/derated. */
killedBy: metamorphic laws parseAwg inverts rendering for every integer gauge 1..40
statusReason: Property failed after 1 tests
{ seed: 1391422015, path: "0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] MethodExpression
src/wire-data.ts:11:49
 
 /** Parse "18AWG" / "18 AWG" / "awg18" → 18. */
 export const parseAwg = (gauge: string): number | undefined => {
-  const match = /(\d+)\s*AWG|AWG\s*(\d+)/i.exec(gauge.trim())
+  const match = /(\d+)\s*AWG|AWG\s*(\d+)/i.exec(gauge)
   const raw = match?.[1] ?? match?.[2]
   if (raw === undefined) return undefined

[Killed] LogicalOperator
src/wire-data.ts:12:15
 /** Parse "18AWG" / "18 AWG" / "awg18" → 18. */
 export const parseAwg = (gauge: string): number | undefined => {
   const match = /(\d+)\s*AWG|AWG\s*(\d+)/i.exec(gauge.trim())
-  const raw = match?.[1] ?? match?.[2]
+  const raw = match?.[1] && match?.[2]
   if (raw === undefined) return undefined
   const n = Number(raw)
killedBy: metamorphic laws parseAwg inverts rendering for every integer gauge 1..40
statusReason: Property failed after 1 tests
{ seed: -1223372038, path: "0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] OptionalChaining
src/wire-data.ts:12:29
 /** Parse "18AWG" / "18 AWG" / "awg18" → 18. */
 export const parseAwg = (gauge: string): number | undefined => {
   const match = /(\d+)\s*AWG|AWG\s*(\d+)/i.exec(gauge.trim())
-  const raw = match?.[1] ?? match?.[2]
+  const raw = match?.[1] ?? match[2]
   if (raw === undefined) return undefined
   const n = Number(raw)
killedBy: parseAwg rejects non-gauges
statusReason: Cannot read properties of null (reading '2')

[Killed] EqualityOperator
src/wire-data.ts:13:7
 export const parseAwg = (gauge: string): number | undefined => {
   const match = /(\d+)\s*AWG|AWG\s*(\d+)/i.exec(gauge.trim())
   const raw = match?.[1] ?? match?.[2]
-  if (raw === undefined) return undefined
+  if (raw !== undefined) return undefined
   const n = Number(raw)
   return Number.isInteger(n) && n > 0 ? n : undefined
killedBy: metamorphic laws parseAwg inverts rendering for every integer gauge 1..40
statusReason: Property failed after 1 tests
{ seed: 298945317, path: "0", endOnFailure: true }
Counterexample: [1]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/wire-data.ts:13:7
 export const parseAwg = (gauge: string): number | undefined => {
   const match = /(\d+)\s*AWG|AWG\s*(\d+)/i.exec(gauge.trim())
   const raw = match?.[1] ?? match?.[2]
-  if (raw === undefined) return undefined
+  if (true) return undefined
   const n = Number(raw)
   return Number.isInteger(n) && n > 0 ? n : undefined
killedBy: metamorphic laws parseAwg inverts rendering for every integer gauge 1..40
statusReason: Property failed after 1 tests
{ seed: 357178944, path: "0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/wire-data.ts:15:10
   const raw = match?.[1] ?? match?.[2]
   if (raw === undefined) return undefined
   const n = Number(raw)
-  return Number.isInteger(n) && n > 0 ? n : undefined
+  return Number.isInteger(n) || n > 0 ? n : undefined
 }
 
killedBy: parseAwg rejects zero (and therefore aught sizes — 4/0AWG is out of scope)
statusReason: expected +0 to be undefined

[Killed] ConditionalExpression
src/wire-data.ts:15:10
   const raw = match?.[1] ?? match?.[2]
   if (raw === undefined) return undefined
   const n = Number(raw)
-  return Number.isInteger(n) && n > 0 ? n : undefined
+  return false ? n : undefined
 }
 
killedBy: metamorphic laws parseAwg inverts rendering for every integer gauge 1..40
statusReason: Property failed after 1 tests
{ seed: -406815094, path: "0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/wire-data.ts:19:66
 }
 
 /** Max continuous current (A) per AWG, bundled/derated. */
-export const AMPACITY_BY_AWG: Readonly<Record<number, number>> = {
-  30: 0.3,
-  28: 0.5,
-  26: 0.8,
-  24: 1.4,
-  22: 2.3,
-  20: 3.7,
-  18: 5.9,
-  16: 9.4,
-  14: 15,
-  12: 24,
-  10: 38
-}
+export const AMPACITY_BY_AWG: Readonly<Record<number, number>> = {}
 
 /** Smallest (thickest-allowed) AWG number that carries `current` amps, or undefined if off-table. */
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: expected undefined to be 20 // Object.is equality

[Killed] BlockStatement
src/wire-data.ts:34:79
 }
 
 /** Smallest (thickest-allowed) AWG number that carries `current` amps, or undefined if off-table. */
-export const requiredAwgForCurrent = (current: number): number | undefined => {
-  const candidates = Object.entries(AMPACITY_BY_AWG)
-    .map(([awg, amps]) => [Number(awg), amps] as const)
-    .filter(([, amps]) => amps >= current)
-    .map(([awg]) => awg)
-  return candidates.length > 0 ? Math.max(...candidates) : undefined
-}
+export const requiredAwgForCurrent = (current: number): number | undefined => {}
 
 // Ground is token-aware (signal treated as _-separated tokens): prefixed
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: expected undefined to be 20 // Object.is equality

[Killed] MethodExpression
src/wire-data.ts:35:22
 
 /** Smallest (thickest-allowed) AWG number that carries `current` amps, or undefined if off-table. */
 export const requiredAwgForCurrent = (current: number): number | undefined => {
-  const candidates = Object.entries(AMPACITY_BY_AWG)
-    .map(([awg, amps]) => [Number(awg), amps] as const)
-    .filter(([, amps]) => amps >= current)
+  const candidates = Object.entries(AMPACITY_BY_AWG).map(([awg, amps]) => [Number(awg), amps] as const)
     .map(([awg]) => awg)
   return candidates.length > 0 ? Math.max(...candidates) : undefined
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: expected 30 to be 20 // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:36:10
 /** Smallest (thickest-allowed) AWG number that carries `current` amps, or undefined if off-table. */
 export const requiredAwgForCurrent = (current: number): number | undefined => {
   const candidates = Object.entries(AMPACITY_BY_AWG)
-    .map(([awg, amps]) => [Number(awg), amps] as const)
+    .map(() => undefined)
     .filter(([, amps]) => amps >= current)
     .map(([awg]) => awg)
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/wire-data.ts:37:27
 export const requiredAwgForCurrent = (current: number): number | undefined => {
   const candidates = Object.entries(AMPACITY_BY_AWG)
     .map(([awg, amps]) => [Number(awg), amps] as const)
-    .filter(([, amps]) => amps >= current)
+    .filter(([, amps]) => false)
     .map(([awg]) => awg)
   return candidates.length > 0 ? Math.max(...candidates) : undefined
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:37:13
 export const requiredAwgForCurrent = (current: number): number | undefined => {
   const candidates = Object.entries(AMPACITY_BY_AWG)
     .map(([awg, amps]) => [Number(awg), amps] as const)
-    .filter(([, amps]) => amps >= current)
+    .filter(() => undefined)
     .map(([awg]) => awg)
   return candidates.length > 0 ? Math.max(...candidates) : undefined
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:38:10
   const candidates = Object.entries(AMPACITY_BY_AWG)
     .map(([awg, amps]) => [Number(awg), amps] as const)
     .filter(([, amps]) => amps >= current)
-    .map(([awg]) => awg)
+    .map(() => undefined)
   return candidates.length > 0 ? Math.max(...candidates) : undefined
 }
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: expected NaN to be 20 // Object.is equality

[Killed] EqualityOperator
src/wire-data.ts:39:10
     .map(([awg, amps]) => [Number(awg), amps] as const)
     .filter(([, amps]) => amps >= current)
     .map(([awg]) => awg)
-  return candidates.length > 0 ? Math.max(...candidates) : undefined
+  return candidates.length <= 0 ? Math.max(...candidates) : undefined
 }
 
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: expected undefined to be 20 // Object.is equality

[Killed] MethodExpression
src/wire-data.ts:39:34
     .map(([awg, amps]) => [Number(awg), amps] as const)
     .filter(([, amps]) => amps >= current)
     .map(([awg]) => awg)
-  return candidates.length > 0 ? Math.max(...candidates) : undefined
+  return candidates.length > 0 ? Math.min(...candidates) : undefined
 }
 
killedBy: ampacity table requiredAwgForCurrent picks the thinnest sufficient gauge
statusReason: expected 10 to be 20 // Object.is equality

[Killed] Regex
src/wire-data.ts:47:22
 // Power stays ANCHORED on purpose: token-matching "5V" anywhere would
 // misclassify enable/sense lines (EN_5V, SENSE_24V) as rails and fire
 // false ground-return errors.
-const POWER_SIGNAL = /^(VBAT|VCC|VDD|VIN|VSYS|PWR|\+?\d+(\.\d+)?V)/i
+const POWER_SIGNAL = /^(VBAT|VCC|VDD|VIN|VSYS|PWR|\+?\d(\.\d+)?V)/i
 const GROUND_SIGNAL = /(^|_)([ADPSC]?GND|GROUND|0V|RTN|RETURN|VSS)(_|$)/i
 const SHIELD_SIGNAL = /(SHIELD|DRAIN|SHLD)/i
killedBy: signal classifiers power: rails and voltage names
statusReason: 24V_RAIL: expected false to be true // Object.is equality

[Killed] Regex
src/wire-data.ts:47:22
 // Power stays ANCHORED on purpose: token-matching "5V" anywhere would
 // misclassify enable/sense lines (EN_5V, SENSE_24V) as rails and fire
 // false ground-return errors.
-const POWER_SIGNAL = /^(VBAT|VCC|VDD|VIN|VSYS|PWR|\+?\d+(\.\d+)?V)/i
+const POWER_SIGNAL = /^(VBAT|VCC|VDD|VIN|VSYS|PWR|\+?\d+(\.\D+)?V)/i
 const GROUND_SIGNAL = /(^|_)([ADPSC]?GND|GROUND|0V|RTN|RETURN|VSS)(_|$)/i
 const SHIELD_SIGNAL = /(SHIELD|DRAIN|SHLD)/i
killedBy: signal classifiers power: rails and voltage names
statusReason: 3.3V: expected false to be true // Object.is equality

[Killed] Regex
src/wire-data.ts:48:23
 // misclassify enable/sense lines (EN_5V, SENSE_24V) as rails and fire
 // false ground-return errors.
 const POWER_SIGNAL = /^(VBAT|VCC|VDD|VIN|VSYS|PWR|\+?\d+(\.\d+)?V)/i
-const GROUND_SIGNAL = /(^|_)([ADPSC]?GND|GROUND|0V|RTN|RETURN|VSS)(_|$)/i
+const GROUND_SIGNAL = /(^|_)([^ADPSC]?GND|GROUND|0V|RTN|RETURN|VSS)(_|$)/i
 const SHIELD_SIGNAL = /(SHIELD|DRAIN|SHLD)/i
 
killedBy: signal classifiers ground is token-aware: prefixed and suffixed grounds classify
statusReason: AGND: expected false to be true // Object.is equality

[Killed] Regex
src/wire-data.ts:48:23
 // misclassify enable/sense lines (EN_5V, SENSE_24V) as rails and fire
 // false ground-return errors.
 const POWER_SIGNAL = /^(VBAT|VCC|VDD|VIN|VSYS|PWR|\+?\d+(\.\d+)?V)/i
-const GROUND_SIGNAL = /(^|_)([ADPSC]?GND|GROUND|0V|RTN|RETURN|VSS)(_|$)/i
+const GROUND_SIGNAL = /(_)([ADPSC]?GND|GROUND|0V|RTN|RETURN|VSS)(_|$)/i
 const SHIELD_SIGNAL = /(SHIELD|DRAIN|SHLD)/i
 
killedBy: signal classifiers ground is token-aware: prefixed and suffixed grounds classify
statusReason: GND: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:51:30
 const GROUND_SIGNAL = /(^|_)([ADPSC]?GND|GROUND|0V|RTN|RETURN|VSS)(_|$)/i
 const SHIELD_SIGNAL = /(SHIELD|DRAIN|SHLD)/i
 
-export const isPowerSignal = (signal: string): boolean => POWER_SIGNAL.test(signal)
+export const isPowerSignal = () => undefined
 export const isGroundSignal = (signal: string): boolean => GROUND_SIGNAL.test(signal)
 export const isShieldSignal = (signal: string): boolean => SHIELD_SIGNAL.test(signal)
killedBy: signal classifiers power: rails and voltage names
statusReason: VBAT_24V: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:52:31
 const SHIELD_SIGNAL = /(SHIELD|DRAIN|SHLD)/i
 
 export const isPowerSignal = (signal: string): boolean => POWER_SIGNAL.test(signal)
-export const isGroundSignal = (signal: string): boolean => GROUND_SIGNAL.test(signal)
+export const isGroundSignal = () => undefined
 export const isShieldSignal = (signal: string): boolean => SHIELD_SIGNAL.test(signal)
 
killedBy: signal classifiers ground is token-aware: prefixed and suffixed grounds classify
statusReason: GND: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:53:31
 
 export const isPowerSignal = (signal: string): boolean => POWER_SIGNAL.test(signal)
 export const isGroundSignal = (signal: string): boolean => GROUND_SIGNAL.test(signal)
-export const isShieldSignal = (signal: string): boolean => SHIELD_SIGNAL.test(signal)
+export const isShieldSignal = () => undefined
 
 /**
killedBy: signal classifiers shield: unanchored, so prefixed drains match
statusReason: SHIELD: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/wire-data.ts:59:76
  * Known differential / twisted-pair signal pairs (PRD §9.4: CAN, RS-485,
  * USB, Ethernet). Each entry maps a signal to its expected partner.
  */
-export const differentialPartner = (signal: string): string | undefined => {
-  const s = signal.toUpperCase()
-  const table: ReadonlyArray<readonly [RegExp, (s: string) => string]> = [
-    // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
-    [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
-    [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
-    [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
-    [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
-    [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
-    [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
-    [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
-    [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
-  ]
-  for (const [pattern, partner] of table) {
-    if (pattern.test(s)) return partner(s)
-  }
-  return undefined
-}
+export const differentialPartner = (signal: string): string | undefined => {}
 
killedBy: differentialPartner CAN with and without underscore, with bus prefixes
statusReason: expected undefined to be 'CAN_L' // Object.is equality

[Killed] MethodExpression
src/wire-data.ts:60:13
  * USB, Ethernet). Each entry maps a signal to its expected partner.
  */
 export const differentialPartner = (signal: string): string | undefined => {
-  const s = signal.toUpperCase()
+  const s = signal.toLowerCase()
   const table: ReadonlyArray<readonly [RegExp, (s: string) => string]> = [
     // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
killedBy: differentialPartner CAN with and without underscore, with bus prefixes
statusReason: expected undefined to be 'CAN_L' // Object.is equality

[Killed] ArrayDeclaration
src/wire-data.ts:61:74
  */
 export const differentialPartner = (signal: string): string | undefined => {
   const s = signal.toUpperCase()
-  const table: ReadonlyArray<readonly [RegExp, (s: string) => string]> = [
-    // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
-    [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
-    [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
-    [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
-    [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
-    [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
-    [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
-    [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
-    [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
-  ]
+  const table: ReadonlyArray<readonly [RegExp, (s: string) => string]> = []
   for (const [pattern, partner] of table) {
     if (pattern.test(s)) return partner(s)
killedBy: differentialPartner CAN with and without underscore, with bus prefixes
statusReason: expected undefined to be 'CAN_L' // Object.is equality

[Killed] UnaryOperator
src/wire-data.ts:63:43
   const s = signal.toUpperCase()
   const table: ReadonlyArray<readonly [RegExp, (s: string) => string]> = [
     // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
-    [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
+    [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, +1) + "L"],
     [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
killedBy: differentialPartner CAN with and without underscore, with bus prefixes
statusReason: expected 'CL' to be 'CAN_L' // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:63:25
   const s = signal.toUpperCase()
   const table: ReadonlyArray<readonly [RegExp, (s: string) => string]> = [
     // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
-    [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
+    [/^(.*)CAN\d*_?H$/, () => undefined],
     [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
killedBy: differentialPartner CAN with and without underscore, with bus prefixes
statusReason: expected undefined to be 'CAN_L' // Object.is equality

[Killed] UnaryOperator
src/wire-data.ts:64:43
   const table: ReadonlyArray<readonly [RegExp, (s: string) => string]> = [
     // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
     [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
-    [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
+    [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, +1) + "H"],
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
killedBy: differentialPartner anchors (regex mutants) pairs the no-underscore spellings (kills _?-tightening mutants)
statusReason: expected 'CH' to be 'CANH' // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:64:25
   const table: ReadonlyArray<readonly [RegExp, (s: string) => string]> = [
     // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
     [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
-    [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
+    [/^(.*)CAN\d*_?L$/, () => undefined],
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
killedBy: differentialPartner CAN with and without underscore, with bus prefixes
statusReason: expected undefined to be 'MOTOR_CAN_H' // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:65:24
     // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
     [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
     [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
-    [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
+    [/^(.*)RS485_?A$/, () => undefined],
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
killedBy: differentialPartner anchors (regex mutants) pairs the no-underscore spellings (kills _?-tightening mutants)
statusReason: expected undefined to be 'RS485B' // Object.is equality

[Killed] UnaryOperator
src/wire-data.ts:65:42
     // Bus index allowed: CAN_H, CANH, CAN1_H, MOTOR_CAN2_H all pair.
     [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
     [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
-    [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
+    [/^(.*)RS485_?A$/, (m) => m.slice(0, +1) + "B"],
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
killedBy: differentialPartner anchors (regex mutants) pairs the no-underscore spellings (kills _?-tightening mutants)
statusReason: expected 'RB' to be 'RS485B' // Object.is equality

[Killed] UnaryOperator
src/wire-data.ts:66:42
     [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
     [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
-    [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
+    [/^(.*)RS485_?B$/, (m) => m.slice(0, +1) + "A"],
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
     [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
killedBy: differentialPartner RS-485, generic _P/_N, USB
statusReason: expected 'RA' to be 'RS485A' // Object.is equality

[Killed] MethodExpression
src/wire-data.ts:66:31
     [/^(.*)CAN\d*_?H$/, (m) => m.slice(0, -1) + "L"],
     [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
-    [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
+    [/^(.*)RS485_?B$/, (m) => m + "A"],
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
     [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
killedBy: differentialPartner RS-485, generic _P/_N, USB
statusReason: expected 'RS485BA' to be 'RS485A' // Object.is equality

[Killed] MethodExpression
src/wire-data.ts:67:25
     [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
-    [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
+    [/^(.*)_P$/, (m) => m + "_N"],
     [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
     [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
killedBy: differentialPartner RS-485, generic _P/_N, USB
statusReason: expected 'LVDS_P_N' to be 'LVDS_N' // Object.is equality

[Killed] UnaryOperator
src/wire-data.ts:67:36
     [/^(.*)CAN\d*_?L$/, (m) => m.slice(0, -1) + "H"],
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
-    [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
+    [/^(.*)_P$/, (m) => m.slice(0, +2) + "_N"],
     [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
     [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
killedBy: differentialPartner RS-485, generic _P/_N, USB
statusReason: expected 'LV_N' to be 'LVDS_N' // Object.is equality

[Killed] UnaryOperator
src/wire-data.ts:68:36
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
-    [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
+    [/^(.*)_N$/, (m) => m.slice(0, +2) + "_P"],
     [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
     [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
killedBy: differentialPartner RS-485, generic _P/_N, USB
statusReason: expected 'LV_P' to be 'LVDS_P' // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:68:18
     [/^(.*)RS485_?A$/, (m) => m.slice(0, -1) + "B"],
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
-    [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
+    [/^(.*)_N$/, () => undefined],
     [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
     [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
killedBy: differentialPartner RS-485, generic _P/_N, USB
statusReason: expected undefined to be 'LVDS_P' // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:69:23
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
     [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
-    [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
+    [/^(.*)USB_?DP$/, () => undefined],
     [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
   ]
killedBy: differentialPartner RS-485, generic _P/_N, USB
statusReason: expected undefined to be 'USB_DM' // Object.is equality

[Killed] Regex
src/wire-data.ts:69:6
     [/^(.*)RS485_?B$/, (m) => m.slice(0, -1) + "A"],
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
     [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
-    [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
+    [/^(.*)USB_DP$/, (m) => m.replace(/DP$/, "DM")],
     [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
   ]
killedBy: differentialPartner anchors (regex mutants) pairs the no-underscore spellings (kills _?-tightening mutants)
statusReason: expected undefined to be 'USBDM' // Object.is equality

[Killed] ArrowFunction
src/wire-data.ts:70:23
     [/^(.*)_P$/, (m) => m.slice(0, -2) + "_N"],
     [/^(.*)_N$/, (m) => m.slice(0, -2) + "_P"],
     [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
-    [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
+    [/^(.*)USB_?DM$/, () => undefined]
   ]
   for (const [pattern, partner] of table) {
killedBy: differentialPartner RS-485, generic _P/_N, USB
statusReason: expected undefined to be 'USBDP' // Object.is equality

[Killed] BlockStatement
src/wire-data.ts:72:43
     [/^(.*)USB_?DP$/, (m) => m.replace(/DP$/, "DM")],
     [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
   ]
-  for (const [pattern, partner] of table) {
-    if (pattern.test(s)) return partner(s)
-  }
+  for (const [pattern, partner] of table) {}
   return undefined
 }
killedBy: differentialPartner CAN with and without underscore, with bus prefixes
statusReason: expected undefined to be 'CAN_L' // Object.is equality

[Killed] ConditionalExpression
src/wire-data.ts:73:9
     [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
   ]
   for (const [pattern, partner] of table) {
-    if (pattern.test(s)) return partner(s)
+    if (true) return partner(s)
   }
   return undefined
killedBy: differentialPartner anchors (regex mutants) does not pair signals with trailing garbage (kills $-drop mutants)
statusReason: expected 'CAN_H_SHIELL' to be undefined

[Killed] ConditionalExpression
src/wire-data.ts:73:9
     [/^(.*)USB_?DM$/, (m) => m.replace(/DM$/, "DP")]
   ]
   for (const [pattern, partner] of table) {
-    if (pattern.test(s)) return partner(s)
+    if (false) return partner(s)
   }
   return undefined
killedBy: differentialPartner CAN with and without underscore, with bus prefixes
statusReason: expected undefined to be 'CAN_L' // Object.is equality
